-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 04, 2026 at 08:13 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `al_class_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `attendance`
--

CREATE TABLE `attendance` (
  `attendance_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `date` date NOT NULL,
  `status` enum('Present','Absent') DEFAULT 'Present',
  `time` time DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `attendance`
--

INSERT INTO `attendance` (`attendance_id`, `student_id`, `date`, `status`, `time`) VALUES
(2, 5, '2025-12-02', 'Present', '16:31:06'),
(3, 7, '2025-12-05', 'Absent', '15:45:53'),
(4, 9, '2025-12-08', 'Present', '10:52:06'),
(5, 7, '2025-12-08', 'Present', '07:42:48'),
(6, 1, '2025-12-09', 'Present', '12:30:22'),
(7, 7, '2025-12-09', 'Absent', '08:03:07'),
(8, 5, '2025-12-09', 'Present', '09:28:59');

-- --------------------------------------------------------

--
-- Table structure for table `classes`
--

CREATE TABLE `classes` (
  `class_id` int(11) NOT NULL,
  `class_name` varchar(100) NOT NULL,
  `stream` varchar(50) NOT NULL,
  `subject` varchar(50) NOT NULL,
  `teacher_name` varchar(100) DEFAULT NULL,
  `fee` decimal(10,2) NOT NULL,
  `day` varchar(20) DEFAULT NULL,
  `time` varchar(20) DEFAULT NULL,
  `status` tinyint(4) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `classes`
--

INSERT INTO `classes` (`class_id`, `class_name`, `stream`, `subject`, `teacher_name`, `fee`, `day`, `time`, `status`) VALUES
(1, '2025 Revision', 'Physical Science', 'Combined Maths', 'Mr. Perera', 2500.00, 'Saturday', '08:00 AM', 1),
(2, '2026 Theory', 'Bio Science', 'Biology', 'Mrs. Silva', 2000.00, 'Sunday', '10:00 AM', 1),
(3, '2025 Paper Class', 'Commerce', 'Econ', 'Mr. Kamal', 1500.00, 'Friday', '02:30 PM', 1),
(4, 'Bio Revision class', 'Bio Science', 'Bio Revision', 'Dinesh Muthugala', 2500.00, 'Friday', '08:00 am to 02:00 pm', 1),
(5, 'ET for Srimal Wijesinghe', 'Technology', 'Engineering Technology ', 'Srimal Wijesinghe', 2500.00, 'Friday', '08:00 am to 02:00 pm', 1),
(6, 'akila vimanga senevirathna  Sinhala class', 'Arts', 'Sinhala class', 'akila vimanga senevirathna', 2500.00, 'Wednesday', '08:00 to 12:00', 1),
(7, 'ICT fron abc', 'ICT', 'ICT', 'Mr.Ravindu bandaranayake', 3000.00, 'Saturday', '12:00 pm to 04:00 pm', 1);

-- --------------------------------------------------------

--
-- Table structure for table `enrollments`
--

CREATE TABLE `enrollments` (
  `enrollment_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `joined_date` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `enrollments`
--

INSERT INTO `enrollments` (`enrollment_id`, `student_id`, `class_id`, `joined_date`) VALUES
(1, 7, 4, '2025-12-07 10:44:50'),
(7, 7, 1, '2025-12-07 11:02:54'),
(8, 1, 6, '2025-12-07 11:12:55'),
(9, 10, 4, '2025-12-12 15:33:07'),
(10, 10, 2, '2025-12-12 15:33:08'),
(11, 10, 7, '2025-12-12 15:33:08');

-- --------------------------------------------------------

--
-- Table structure for table `exams`
--

CREATE TABLE `exams` (
  `exam_id` int(11) NOT NULL,
  `exam_name` varchar(100) NOT NULL,
  `subject` varchar(50) DEFAULT NULL,
  `date` date DEFAULT NULL,
  `total_marks` int(11) DEFAULT 100
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `exams`
--

INSERT INTO `exams` (`exam_id`, `exam_name`, `subject`, `date`, `total_marks`) VALUES
(1, '2026 1st term test', NULL, '2025-12-02', 100),
(2, '2026 tame 1', NULL, '2025-12-02', 100),
(3, '2026 tame 1', NULL, '2025-12-02', 100);

-- --------------------------------------------------------

--
-- Table structure for table `exam_marks`
--

CREATE TABLE `exam_marks` (
  `mark_id` int(11) NOT NULL,
  `exam_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `marks` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `exam_questions`
--

CREATE TABLE `exam_questions` (
  `question_id` int(11) NOT NULL,
  `exam_id` int(11) NOT NULL,
  `question_text` text NOT NULL,
  `option_1` varchar(255) NOT NULL,
  `option_2` varchar(255) NOT NULL,
  `option_3` varchar(255) NOT NULL,
  `option_4` varchar(255) NOT NULL,
  `option_5` varchar(255) NOT NULL,
  `correct_option` int(1) NOT NULL COMMENT '1, 2, 3, or 4',
  `image_path` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `exam_questions`
--

INSERT INTO `exam_questions` (`question_id`, `exam_id`, `question_text`, `option_1`, `option_2`, `option_3`, `option_4`, `option_5`, `correct_option`, `image_path`) VALUES
(301, 10, 'සන්නිවේදන ක්‍රියාවලිය මූලික වශයෙන් සමන්විත වන්නේ,', 'අදහස් වලිනි.', 'සිදුවීම්වලිනි.', 'සංකේත වලිනි.', 'තොරතුරුවලිනි.', 'පුද්ගලයන්ගෙනි.', 1, NULL),
(302, 10, 'සන්නිවේදකයාගේ අදහස් සහ හැගීම් සංදේශ බවට පරිවර්තනය කිරීමේ ක්‍රියාවලිය,', 'පරිකල්පනයයි.', 'විකේතකරණයයි.', 'භාෂණයයි.', 'ආකේතකරණයයි.', 'සංජානනයයි.', 1, NULL),
(303, 10, 'තිර පිටපත් රචකයෙකු තම අත්දැකීම් ඇසුරෙන් සිදු කරන නිර්මාණයක දී දක්නට ලැබෙන සන්නිවේදන වර්ගය කුමක්ද?', 'නිර්මාණාත්මක', 'අන්තර්පුද්ගල', 'ලිඛිත', 'අවිධිමත්', 'අන්තර්වර්තී පුද්ගල', 1, NULL),
(304, 10, 'සන්නිවේදනය හා එය සිදුවන වටපිටාව අතර පවත්නා සම්බන්ධය යනුවෙන් අදහස් කරන්නේ,', 'අරමුණු සහගත වීම ය.', 'සංකේතාත්මක වීම ය.', 'විවිධාකාර වීම ය.', 'සන්දර්භානුගත වීම ය.', 'ඒක මාර්ගික හා ද්විමාර්ගික වීමය.', 1, NULL),
(305, 10, 'දුරකථනය හා ටෙලිග්‍රාෆ් තාක්ෂණය වර්ධනය වීමේ ප්‍රතිඵලයක් ලෙස බිහි වූයේ කුමක්ද?', 'පුවත්පත', 'සඟරාව', 'විද්‍යුත් පුවත්පත', 'රූපවාහිනිය', 'ගුවන් විදුලිය', 1, NULL),
(306, 10, 'අන්තර් ක්‍රියාකාරී සන්නිවේදනයක යෙදීම වඩාත් පහසු වන්නේ,', 'අන්තර් පුද්ගල සන්නිවේදනයේ දීය.', 'සමූහ සන්නිවේදනයේ දී ය.', 'අතථ්‍ය සන්නිවේදනයේ දී ය.', 'යන්ත්‍ර - සහායක අන්තර් පුද්ගල සන්නිවේදනයේ දීය.', 'යන්ත්‍ර - සහායක සමූහ සන්නිවේදනයේ දී ය.', 1, NULL),
(307, 10, 'ෆෙඩරල් සන්නිවේදන කොමිසම යනු,', 'අමෙරිකානු මාධ්‍ය නියාමන ආයතනයකි.', 'බ්‍රිතාන්‍ය ගුවන් විදුලි නියාමන ආයතනයකි.', 'මහජන සේවා දිරිගන්වන ගෝලීය ආයතනයකි.', 'ගුවන් විදුලි තරංග නියාමන අධිකාරියකි.', 'සමාජ මාධ්‍ය නියාමන ආයතනයකි.', 1, NULL),
(308, 10, 'ගුවන් විදුලි මාධ්‍ය වැඩසටහනක දී වැඩිම අවධානය යොමුවන පාර්ශ්වය වන්නේ,', 'සන්නිවේදකයාය.', 'හිමිකරුවාය.', 'අනුග්‍රාහකයාය.', 'ග්‍රාහකයා ය.', 'වාර්තාකරුවා ය.', 1, NULL),
(309, 10, 'එදිනෙදා ජිවිතයට අවශ්‍ය තොරතුරු ඇතුළත් කරමින් නිශ්චිත කාලවකවානුවක දී එකට බැඳ අඛණ්ඩව ප්‍රකාශයට පත් කරනු ලබන්නේ, (1) පුවත්පත් ය.', 'පොත් ය.', 'ආගමික පත්‍රිකාය.', 'සඟරා ය.', 'අණ පනත්ය.', '-', 1, NULL),
(310, 10, 'ජනමාධ්‍ය තොරතුරුවල දැකිය හැකි වඩාත් කැපීපෙනෙන ගුණාංගය වන්නේ,', 'විවිධත්වයයි.', 'සංකීර්ණත්වයයි.', 'දෛනිකත්වයයි.', 'ආකර්ශණීයත්වයයි.', 'විශ්වසනීයත්වයයි.', 1, NULL),
(311, 10, 'තොරතුරු ගබඩා කර සංරක්ෂණය කිරීම සඳහා පදනම සකස් වන්නේ,', 'භාෂාවේ සම්භවයත් සමග ය.', 'ලේඛනයේ ආරම්භයත් සමගය.', 'ජනමාධ්‍යවල ආරම්භයත් සමඟ ය.', 'මුද්‍රණ තාක්ෂණයේ දියුණුවත් සමඟ ය.', 'ඩිජිටල් දත්ත සංචිත කරණයේ ආගමනයත් සමග ය.', 1, NULL),
(312, 10, 'ජනමාධ්‍ය මගින් ඉදිරිපත් වන තොරතුරු පිළිබඳ තීරණ ගනු ලබන්නේ,', 'මාධ්‍ය හිමිකරුවන් ය.', 'දැන්වීම්කරුවන්ය.', 'සංස්කාරකවරුන් ය.', 'දොරටුපාලකයන්ය.', 'නිසි බලධාරින්ය.', 1, NULL),
(313, 10, '\"මහජන සම්බන්ධතා යනු යහපත් සිතින් යුතුව මානව සදාචාර සම්පන්න භාවය ඇති කිරීම සඳහා ගනු ලබන ක්‍රියාමාර්ග බව\" සඳහන් කළේ කවුරුන් ද/ කවර ආයතනයද?', 'එඩ්වඩ් එල්. බර්නීස්', 'චාර්ල්ස් ප්ලැකාඩ්', 'සෑම් බ්ලැක්', 'ජෝශප් ආර්. ඩොමිනික්', 'බ්‍රිතාන්‍ය මහජන සමබන්ධතා පිළිබඳ වරලත් ආයතනය', 1, NULL),
(314, 10, 'පහත අදහස් සලකන්න. A - ග්‍රාහකයාට අනුව වචන තෝරා ගත හැකි ය B - අවධානයෙන් සවන් දීම සිදු කළ හැකි ය C - නිර්වාචික සන්නිවේදනය භාවිත කළ හැකි ය D - නිශ්චිත ධූරාවලියක් දැකගත හැකි ය', 'A හා B', 'A හා C', 'B හා C', 'B හා D', 'C හා D', 1, NULL),
(315, 10, 'මාධ්‍ය සාක්ෂරතාවට අදාළ ඥාන ව්‍යුහ ගොඩනැගෙන්නේ,', 'පලපුරුද්දෙනි.', 'අවිඥානිකවය.', 'පුද්ගලයාගේ අරමුණු ඇසුරෙනි.', 'සමාජ අන්තර් ක්‍රියාකාරිත්වයෙනි.', 'තෝරාගත් තොරතුරු සමූහයක් ඇසුරෙනි.', 1, NULL),
(316, 10, 'භවභෝග ආරක්ෂා කර ගැනීම, අපල උපද්‍රව වලින් වැළකීම හා විනෝදාස්වාදය ලබාදීම වැනි කරුණු අරමුණු කර ගත් සාම්ප්‍රදායික මාධ්‍ය විධික්‍රමයක් වන්නේ,', 'ජන කවියයි.', 'ජන කතාවයි.', 'කෝලම් නාට්‍යයයි.', 'යාතුකර්මයි.', 'සොකරි නාට්‍යයයි.', 1, NULL),
(317, 10, 'වර්තමානයේ දී යමෙකුට අන්තර්ජාලය මගින් පුවත්පත් කියවීමට, ගුවන් විදුලිය ශ්‍රවණය කිරීමට මෙන්ම රූපවාහිනිය හා චිත්‍රපට නැරඹීමට අවස්ථාව හිමි වී තිබේ. මෙම තත්වය හඳුන්වන සංකල්පය වන්නේ,', 'නිර්මහා පරිමාණ කරණයයි.', 'මාධ්‍ය අභිසාරිතාවයි.', 'නිර්නියාමනයයි.', 'ගෝලීය කරණයයි.', 'මාධ්‍ය නියාමනයයි.', 1, NULL),
(318, 10, '\'Many Voices, One World\' කෘතිය ප්‍රකාශයට පත් කරන ලද්දේ,', 'එක්සත් ජාතීන්ගේ සංවිධානයෙනි.', 'නොබැඳි සමුළුවෙනි.', 'යුනෙස්කෝ සංවිධානයෙනි.', 'පොදු රාජ්‍ය මණ්ඩලයෙනි.', 'යුරෝපා සංගමයෙනි.', 1, NULL),
(319, 10, 'මාධ්‍ය සාක්ෂරතාව යනු බහු මාත සහිත සංකල්පයකි. ඊට අයත් ප්‍රධාන මාන වන්නේ,', 'සංජානන, චිත්තවේගී, සෞන්දර්යාත්මක හා සදාචාර මානයි.', 'චිත්තවේගී, සෞන්දර්යාත්මක, සදාචාර හා දේශපාලනික මානයි.', 'සෞන්දර්යාත්මක, සදාචාර, පෞද්ගලික හා අන්තර් ක්‍රියාකාරී මානයි.', 'සදාචාර, පෞද්ගලික, දේශපාලනික හා චිත්තවේගී මානයි.', 'පෞද්ගලික, අන්තර් ක්‍රියාකාරී, චිත්තවේගී හා සංජානන මානයි.', 1, NULL),
(320, 10, 'මානව හිමිකම් පිළිබඳ විශ්ව ප්‍රකාශනය,', 'ගිවිසුමක ස්වභාවය පෙන්නුම් කරන අතර ඍජු නෛතික බැඳීමකින් යුක්ත වූවකි.', 'භාෂණයේ හා ප්‍රකාශනයේ හිමිකම පාදක කර ගත් ලියවිල්ලකි.', 'එක්සත් ජාතීන්ගේ සංවිධානයට අයත් රටවල පුරවැසියන්ට අදාළ වූවකි.', 'පළමු ලෝක යුද්ධයේ අත්දැකීම්වල ප්‍රතිඵලයක් ලෙස ප්‍රකාශයට පත් වූවකි.', 'බොහෝ රටවල මූලික අයිතිවාසිකම් සඳහා පදනම සකස් කරන ලද්දකි.', 1, NULL),
(321, 10, 'නව මාධ්‍ය හා සමාජ මාධ්‍යට විශේෂිත කාර්යයන් වන්නේ,', 'තොරතුරු හා විනෝදාස්වාද සම්පාදනයයි.', 'සමාජානුයෝජනය හා අධ්‍යාපනයයි.', 'විකල්ප මණ්ඩප මෙන්ම සම්බන්ධතා ගොඩනැගීමයි.', 'සුපරීක්ෂණය හා අර්ථකථනයයි.', 'ආරක්ෂකයකු හා ගුරුවරයකුගේ භූමිකාවයි.', 1, NULL),
(322, 10, 'සිනමාව සමග සැසඳීමේ දී රූපවාහිනියට විශේෂිත ලක්ෂණයක් වන්නේ, එය', 'සාමූහික නිර්මාණ කාර්ය සහිත වීම ය.', 'තිර රචනා උපයෝගී කර ගැනීමය.', 'කලාත්මක මාධ්‍යයක් වීම ය.', 'පොදු මාධ්‍යයක් වීම ය.', 'දෘශ්‍ය සාක්ෂරතාව උපයෝගී කර ගැනීම ය.', 1, NULL),
(323, 10, 'සමකාලීන ජනප්‍රිය සංස්කෘතිය තුළ රූපවාහිනී මාධ්‍යය වඩාත් අවධානය යොමු කරන ලක්ෂණය වන්නේ,', 'අධ්‍යාපනයේ වටිනාකමයි.', 'මානව වාදයට ගරු කිරීමයි.', 'අල්පේච්ඡතාවෙහි වටිනාකමයි.', 'සෞන්දර්යාංයාංගයන්හි වැදගත්කමයි.', 'පරිභෝජනයේ ආකර්ෂණයයි.', 1, NULL),
(324, 10, 'මාධ්‍ය විසින් මවනු ලබන මායාව හා යථාර්ථය හඳුනා ගැනීමට අවශ්‍ය ඥානය ගොඩනැගෙන්නේ,', 'මාධ්‍ය අධ්‍යාපනයෙනි.', 'මාධ්‍ය සාක්ෂරතාවෙනි.', 'මාධ්‍ය විචාරයෙනි.', 'මාධ්‍ය විශ්ලේෂණයෙනි.', 'මාධ්‍ය පිළිබඳ අවධානයෙනි.', 1, NULL),
(325, 10, '\"අපේ කාලේ නම් ඔය එක එක ජන මාධ්‍යයන්ගෙන් කියන ඒවට වඩා අපි දැනුම ලබා ගත්තේ අපේ මුතුන් මිත්තන්ගෙන්\" යැයි සීයා කීවේ ය. ඔහු සඳහන් කරන්නේ,', 'ජන විශ්වාස පිළිබඳවයි.', 'ජනප්‍රවාද පිළිබඳවයි.', 'ජනශ්‍රැති පිළිබඳවයි.', 'පුරාණෝක්ති පිළිබඳවයි.', 'ජනකතා පිළිබඳවයි.', 1, NULL),
(326, 10, 'සිට 29 දක්වා ප්‍රශ්න සඳහා පහත සන්නිවේදන ආකෘතිය උපයෝගී කර ගන්න. (කථිකයා -> කථාව -> අවස්ථාව -> ශ්‍රාවකයා -> බලපෑම)', '-', '-', '-', '-', '-', 1, NULL),
(327, 10, 'ඉහත සන්නිවේදන ආකෘතිය පිළිබඳ සදොස් ප්‍රකාශය තෝරන්න.', 'එය බටහිර සන්නිවේදන ආකෘතියකි.', 'එය ජනමාධ්‍ය සම්බන්ධයෙන් ඉදිරිපත් වූ ආකෘතියක් නොවේ.', 'එය සමූහ සන්නිවේදනය පිළිබඳ වැඩි අවධානයක් යොමු කරයි.', 'එය තොරතුරු හුවමාරුව ප්‍රකට කරයි.', 'එය ග්‍රාහකයා පොළඹවා ගැනීම පිළිබඳ අවධානය යොමු කරයි.', 1, NULL),
(328, 10, 'ඉහත ආකෘතියෙහි දක්නට නොලැබෙන එහෙත්, හැරල්ඩ් ඩී. ලැස්වෙල්ගේ සන්නිවේදන ආකෘතියෙහි දක්නට ලැබෙන සන්නිවේදන ක්‍රියාවලියට අයත් මූලිකාංගයක් වන්නේ,', 'නාලිකාවයි.', 'ප්‍රතිපෝෂණයයි.', 'බාධකයයි.', 'අත්දැකීම් පසු තලයයි.', 'සම්ප්‍රේෂකයයි.', 1, NULL),
(329, 10, 'ඉහත (26) හා (27) ප්‍රශ්නවල සඳහන් සන්නිවේදන ආකෘති වලින් ශ්‍රාම් සහ ඔස්ගුඩ්ගේ සන්නිවේදන ආකෘතිය වෙනස් වන්නේ, එමගින් (1) බාධකවල ස්වභාවය ප්‍රකට කරන හෙයිනි.', 'සංකේත පිළිබඳ අවධානය යොමු කරන හෙයිනි.', 'ප්‍රතිපෝෂණ ක්‍රියාවලිය ගම්‍ය කරනු ලබන හෙයිනි.', 'සම්ප්‍රේෂකයේ ක්‍රියාකාරීත්වය පෙන්වා දෙන හෙයිනි.', 'අත්දැකීම් පසු තලය පිළිබඳව දක්වා ඇති හෙයිනි.', '-', 1, NULL),
(330, 10, 'ඉහත (26), (27) හා (28) ප්‍රශ්නවල සඳහන් කිසිදු ආකෘතියක දක්නට නොමැති එහෙත් ෂැනන් සහ විවර්ගේ සන්නිවේදන ආකෘතියෙහි දැකිය හැකි සන්නිවේදන ක්‍රියාවලියේ මූලිකාංගයක් වන්නේ,', 'නාලිකාවයි.', 'බාධකයයි.', 'බලපෑමයි.', 'ප්‍රතිපෝෂණයයි.', 'අවස්ථාවයි.', 1, NULL),
(331, 10, 'රාජ්‍ය ආයතනයක සිදු වූ අයථා ගනුදෙනුවක් පිළිබඳ අදාළ කරුණු තහවුරු කොට ගෙන ජනතාව දැනුවත් කිරීමට පුවත්පත් කලාවේදියකු වන ඔබ අපේක්ෂා කරයි. ඒ සඳහා උපයෝගී කර ගත හැකි වඩාත් යෝග්‍ය නෛතික මූලාශ්‍රය වන්නේ,', 'බුද්ධිමය දේපල පනතයි.', 'ශ්‍රී ලංකා පුවත් පත් මණ්ඩල පනතයි.', 'තොරතුරු දැන ගැනීමේ පනතයි.', 'මානව හිමිකම් පිළිබඳ විශ්ව ප්‍රකාශනයයි.', '1978 ආණ්ඩුක්‍රම ව්‍යවස්ථාවේ 14 (i) (අ) අනු ව්‍යවස්ථාවයි.', 1, NULL),
(332, 10, 'සමීක්ෂණයක වාර්තාව කියවන්නකුට වැදගත් විය හැකි අමතර ලේඛන ආදිය ඇතුළත් කළ යුත්තේ,', 'හැඳින්වීමටයි.', 'ක්‍රම වේදයටයි.', 'දත්ත විශ්ලේෂණයටයි.', 'උපග්‍රන්ථයටයි.', 'ආශ්‍රේය මූලාශ්‍රයන්ටයි.', 1, NULL),
(333, 10, 'නිර්මහා පරිමාණකරණය පිළිබඳ පහත ප්‍රකාශ සලකන්න. A - එය විසිවන සියවසේ අග භාගයේ වර්ධනය වී විසිඑක්වන සියවසේ තවදුරටත් ව්‍යාප්ත විය. B - වීඩියෝ ක්‍රීඩා සහ මාර්ගගත ක්‍රීඩා මෙම ක්‍රියාවලියේ ව්‍යාප්තියට දායක වී තිබේ. C - අසමාන හා විවිධත්වයෙන් යුත් ග්‍රාහක ක්ෂේත්‍රයක් නිර්මාණය වේ. D - තමාගේ රුචියට අනුව සංදේශ තෝරා ගැනීමක් වෙනුවට එම සංදේශ වලට අනිවාර්ය ලෙස නිරාවරණය වීමක් මෙහිදී දැකිය හැකි ය.', 'A හා B පමණි.', 'C හා D පමණි.', 'A, B හා C පමණි.', 'B, C හා D පමණි.', 'A, B, C හා D යන සියල්ලම ය.', 1, NULL),
(334, 10, 'ජනප්‍රිය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'ජනප්‍රිය සංස්කෘතිය තුළ ජන සංස්කෘතියේ ශේෂයන් අන්තර්ගත වේ.', 'ජන සංස්කෘතිය කිසිවිටකත් ජනප්‍රිය සංස්කෘතිය යන්නට පර්යාය පදයක් ලෙස නොසැලකේ.', 'සම්භාව්‍ය සංස්කෘතියට ජනතාව සමීප කරවීම ජනප්‍රිය සංස්කෘතියේ මෙහෙවරකි.', 'කර්මාන්තයක් ලෙස වර්ධනය වීමට ඊට ඇත්තේ සාපේක්ෂ අඩු විභවතාවකි.', 'නිශ්චිත ස්ථානයක් හා කාලයක් වෙන් කර ගත යුතු වීම එහි මූලික ලක්ෂණයකි.', 1, NULL),
(335, 10, 'නිර්වාචික සන්නිවේදනය පිළිබඳ පන්තියේ දී සිසුන් අතර මතු වූ අදහස් කිහිපයක් පහත දැක්වේ.', 'රවි පමණි.', 'කමලා පමණි.', 'රුවිනා පමණි.', 'රවි සහ රුවිනා පමණි.', 'රවි, කමලා හා රුවිනා යන සියල්ලන්ම ය.', 1, NULL),
(336, 10, 'සිනමා වැඩ මුළුවක දී ගුරුතුමා ශිෂ්‍යයෙකුට පැවසුවේ, චිත්‍ර පටයක ප්‍රධාන චරිතය ජීවත් වන පරිසරයේ සුන්දරත්වය විදහා දැක්වෙන රූප රාමුවක් ලබා ගත යුතු බවයි. ඒ සඳහා වඩාත් සුදුසු රූප රාමුව වන්නේ,', 'දුර රූපයකි.', 'මධ්‍යම රූපයකි.', 'සමීප රූපයකි.', 'ඉතා සමීප රූපයකි.', 'මධ්‍යම සමීප රූපයකි.', 1, NULL),
(337, 10, 'එක්තරා රූපවාහිනී ආයතනයක හිමිකරුවෙක් එම සමාගම ආරම්භ කොට වසර 5කට පසු වෙනත් අයකුට විකුණා දමන ලදී. මෙම තත්ත්වයට අදාළ වන මාධ්‍ය ප්‍රවණතාව වන්නේ,', 'නිර්නියාමනයයි.', 'පරිභෝජ්‍යකරණයයි.', 'වාණිජකරණයයි.', 'භාණ්ඩ කරණයයි.', 'ගෝලීය කරණයයි.', 1, NULL),
(338, 10, 'සමීක්ෂණ වාර්තාවක හැඳින්වීමේ කොටසට ඇතුළත් කළ යුත්තේ කුමක්ද?', 'සමීක්ෂණය සඳහා භාවිත කළ දත්ත රැස් කළ විධි පිළිබඳ විස්තර', 'සමීක්ෂණය සඳහා භාවිත කළ මූලාශ්‍ර පිළිබඳ විස්තර', 'දත්ත රැස් කිරීමට යොදා ගත් නියැදිය පිළිබඳ විස්තර', 'සමීක්ෂණ ක්‍රියාවලියට පසුබිම් වූ ගැටලුව පිළිබඳ විස්තර', 'දත්ත විශ්ලේෂණ ඇසුරෙන් අනාවරණය කර ගත් කරුණු', 1, NULL),
(339, 10, 'මාධ්‍ය පිළිබඳ ලක්ෂණ කිහිපයක් පහත දැක්වේ. A - සරල බස් වහර භාවිතය B - බහුවිධ ග්‍රාහකත්වය C - ප්‍රමාදිත ප්‍රතිපෝෂණය D - අත්දැකීම් පාදක වීම', 'A හා B සම්ප්‍රදායික මාධ්‍යයට අයත්ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් ය.', 'B හා C ජනමාධ්‍යට අයත් ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා D ජනමාධ්‍යට අයත්ය.', 'A හා D සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා C ජනමාධ්‍යට අයත්ය.', 1, NULL),
(340, 10, 'මාධ්‍ය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'සමාජ අවශ්‍යතා මත තත්වාරෝපණය නොවන්නකි.', 'ජනමාධ්‍ය ආරම්භයත් සමග බිහි වී වර්ධනය වූවක් නොවේ.', 'තොරතුරු සමාජයේ සංස්කෘතිය ලෙස හැඳින්විය නොහැකි ය.', 'මානව සමාජ පරිනාමයේ විඥාපන අවධියට අයත් නොවූවකි.', 'පුද්ගල සමාජානුයෝජනයට සහ සංස්කෘතික ක්‍රියාවලියට උපකාරී නොවන්නකි.', 1, NULL),
(341, 10, 'මාධ්‍ය පිළිබඳ ස්ත්‍රීවාදී විචාරය හා සම්බන්ධ සදොස් ප්‍රකාශය තෝරන්න.', 'ස්ත්‍රී අයිතිවාසිකම් සම්බන්ධ ලිංගිකත්ව සමානාත්මතාව එහි පදනමයි.', 'එය මාධ්‍ය මගින් කාන්තාවන්ට වෙනස් කොට සැලකීම පිලිබඳ අවධානය යොමු කරයි.', 'මාධ්‍ය මගින් ස්ත්‍රිය ඒකාකෘතික ලෙස නිරූපණය කළ යුතු බව මෙමගින් පිළිගැනේ.', 'ස්වාභාවික ලෙස ස්ත්‍රීත්වය මාධ්‍ය මගින් නිරූපණය නොකරන බව මෙහි දී ඉස්මතු කරයි.', 'ස්ත්‍රීත්වය පිළිබඳ වටිනාකම් ව්‍යාප්ත කිරීම උදෙසා මාධ්‍ය දායක විය යුතු බව මෙමගින් පිළිගැනේ.', 1, NULL),
(342, 10, '\"මහජන සම්බන්ධතාවේ දී සන්නිවේදනය මගින් කිසිවක් නොසැඟවිය යුතු ය\" යන අදහස වඩාත් ඉස්මතුව දැක්වෙන්නේ,', 'ප්‍රචාරණ ආකෘතියේ දී ය.', 'මහජන තොරතුරු ආකෘතියේ දීය.', 'පුවත් නියෝජිත ආකෘතියේ දී ය.', 'ද්විමාර්ගික සමමිතික ආකෘතියේ දී ය.', 'ද්විමාර්ගික අසමමිතික ආකෘතියේ දී ය.', 1, NULL),
(343, 10, 'තොරතුරු අයිතිය මූලික අයිතිවාසිකමක් ලෙස තහවුරු කරන ලද දේශීය ආණ්ඩුක්‍රම ව්‍යවස්ථා සංශෝධනය කුමක්ද?', '13 වන සංශෝධනය', '15 වන සංශෝධනය', '18 වන සංශෝධනය', '19 වන සංශෝධනය', '20 වන සංශෝධනය', 1, NULL),
(344, 10, 'විජය නිවාසයේ ක්‍රිඩකයෙක් වන නිමල්ට ක්‍රීඩා උත්සවයේ සිද්ධි කළමනාකාර තනතුර පැවරිණි. නිමල්ගේ කාර්යයට අවම අදාළත්වයක් දක්වන්නේ,', 'අර්බුද අවස්ථා කළමනා කරණයයි.', 'ඉලක්ක කණ්ඩායම් හඳුනා ගැනීමයි.', 'ස්ථානයක් වෙන් කර ගැනීමයි.', 'අයවැය තීරණය කිරීමයි.', 'නිවේදන කටයුතු කිරීමයි.', 1, NULL),
(345, 10, 'මාධ්‍ය නියාමන ප්‍රවේශ හා ලක්ෂණ කිහිපයක් පහත වගුවෙහි දැක් වේ.', 'AX, BZ, CY', 'AX, BY, CZ', 'AY, BZ, CX', 'AY, BX, CZ', 'AZ, BY, CX', 1, NULL),
(346, 10, 'ජනමාධ්‍යයේ කාර්යභාරය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'අවධානයෙන් සිටිමින් තොරතුරු සම්පාදනය සුපරීක්ෂණයයි.', 'විවිධ සිද්ධීන් විවරණය කරමින් ඉදිරිපත් කිරීම තොරතුරු සම්පාදනයයි.', 'පුද්ගල, සමාජ හැසිරීම් හා සිතුම් පැතුම් වල වෙනසක් ඇති කරවීම සමාජානුයෝජනය යි.', 'පුද්ගලයින් හා විවිධ ආයතන අතර අන්‍යෝන්‍ය සම්බන්ධතා වර්ධනය කිරීම උපදෙස් සම්පාදනය යි.', 'සමාජ වටිනාකම් පිළිබඳ ජනතාව දැනුවත් කර පොදු ගැටලු හා අභියෝග හඳුනා ගැනීමට සැලැස්වීම තොරතුරු සම්පාදනයයි.', 1, NULL),
(347, 10, 'එක්සත් ජාතීන්ගේ සංවිධානය විසින් ඉදිරිපත් කළ අන්තර් සම්බන්ධිත සංවර්ධනය සඳහා වන සන්නිවේදන ප්‍රවේශයක් නොවන්නේ,', 'නියාමනය සඳහා සන්නිවේදනයයි.', 'සමාජීය වෙනස්කම් සඳහා සන්නි වේදනයයි.', 'පාරිසරික සමතුලිතතාව සඳහා සන්නිවේදනයයි.', 'හැසිරීම් වෙනස්කම් සඳහා සන්නි වේදනයයි.', 'දරිද්‍රතාව අවම කිරීම සඳහා සන්නිවේදනයයි.', 1, NULL),
(348, 10, 'රූපලාවන්‍ය නිෂ්පාදන අලෙවි කරන සමාගමකට අයත් වෙබ් අඩවියකට තමන්ගේ බැංකු ගිණුම් විස්තර ඇතුළත් කිරීම නිසා මූල්‍ය වංචාවකට හසු වී ඇති බව නිමාලිට වැටහිනි. මේ පිළිබඳව විසඳුමක් ලබා ගැනීමට ඇය පැමිණිලි කළ යුත්තේ,', 'අදාළ රූපලාවන්‍ය නිෂ්පාදන සමාගමටයි.', 'ශ්‍රී ලංකා විදුලි සංදේශ නියාමන කොමිසමටයි.', 'සිය ගිණුම අයත් බැංකුවටයි.', 'ශ්‍රී ලංකා පරිගණක හදිසි ප්‍රතිචාර සංසදයටයි.', 'ශ්‍රී ලංකා මානව හිමිකම් කොමිසමටයි.', 1, NULL),
(349, 10, 'සමීක්ෂණ වාර්තාවක් ලිවීමේ දී එම අධ්‍යයනය සඳහා පරිශීලනය කරන ලද මූලාශ්‍ර පිලිබඳ තොරතුරු ඇතුළත් කළ යුතු ය. එම මූලාශ්‍රය ග්‍රන්ථයක් නම්, ආශ්‍රේය මූලාශ්‍ර දැක්වීමේ දී වැදගත්කමක් හිමි නොවන්නේ,', 'කර්තෘ නාමයට හා ග්‍රන්ථ නාමයට ය.', 'ග්‍රන්ථ නාමයට හා ප්‍රකාශිත වර්ෂයට.', 'ප්‍රකාශිත වර්ෂයට හා ප්‍රකාශිත ආයතනයට ය.', 'ප්‍රකාශිත ආයතනයට හා ස්ථානයට ය.', 'මුද්‍රණකරු හා බෙදාහරින්නන්ටය.', 1, NULL),
(350, 10, 'සංකේත පිළිබඳ නිදොස් ප්‍රකාශය තෝරන්න.', 'ඇතැම් සංකේත දෘශ්‍යමාන නොවේ.', 'ඉඟි හා ඉරියව් සංකේත නොවේ.', 'සංකේත වැරදුන විට සන්නිවේදනයක් සිදු නොවේ.', 'හැගීම් දැනවීමට සංකේත අවශ්‍ය නොවේ.', 'ගන්ධය සංකේතයක් ලෙස ගිණිය හැකි නොවේ.', 1, NULL),
(351, 11, 'ජනමාධ්‍ය තොරතුරුවල දැකිය හැකි වඩාත් කැපීපෙනෙන ගුණාංගය වන්නේ,', 'විවිධත්වයයි.', 'සංකීර්ණත්වයයි.', 'දෛනිකත්වයයි.', 'ආකර්ශණීයත්වයයි.', 'විශ්වසනීයත්වයයි.', 1, NULL),
(352, 11, 'තොරතුරු ගබඩා කර සංරක්ෂණය කිරීම සඳහා පදනම සකස් වන්නේ,', 'භාෂාවේ සම්භවයත් සමග ය.', 'ලේඛනයේ ආරම්භයත් සමගය.', 'ජනමාධ්‍යවල ආරම්භයත් සමඟ ය.', 'මුද්‍රණ තාක්ෂණයේ දියුණුවත් සමඟ ය.', 'ඩිජිටල් දත්ත සංචිත කරණයේ ආගමනයත් සමග ය.', 1, NULL),
(353, 11, 'ජනමාධ්‍ය මගින් ඉදිරිපත් වන තොරතුරු පිළිබඳ තීරණ ගනු ලබන්නේ,', 'මාධ්‍ය හිමිකරුවන් ය.', 'දැන්වීම්කරුවන්ය.', 'සංස්කාරකවරුන් ය.', 'දොරටුපාලකයන්ය.', 'නිසි බලධාරින්ය.', 1, NULL),
(354, 11, '\"මහජන සම්බන්ධතා යනු යහපත් සිතින් යුතුව මානව සදාචාර සම්පන්න භාවය ඇති කිරීම සඳහා ගනු ලබන ක්‍රියාමාර්ග බව\" සඳහන් කළේ කවුරුන් ද/ කවර ආයතනයද?', 'එඩ්වඩ් එල්. බර්නීස්', 'චාර්ල්ස් ප්ලැකාඩ්', 'සෑම් බ්ලැක්', 'ජෝශප් ආර්. ඩොමිනික්', 'බ්‍රිතාන්‍ය මහජන සමබන්ධතා පිළිබඳ වරලත් ආයතනය', 1, NULL),
(355, 11, 'පහත අදහස් සලකන්න (A, B, C, D). ඉහත අදහස් අතුරෙන් ඵලදායි කථන සන්නිවේදනයට වඩාත් අදාළ වන්නේ මින් කවරක්ද?', 'A හා B', 'A හා C', 'B හා C', 'B හා D', 'C හා D', 1, NULL),
(356, 11, 'ජනප්‍රිය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'රවි පමණි.', 'කමලා පමණි.', 'රුවිනා පමණි.', 'රවි සහ රුවිනා පමණි.', 'රවි, කමලා හා රුවිනා යන සියල්ලන්ම ය.', 3, NULL),
(357, 11, 'නිර්වාචික සන්නිවේදනය පිළිබඳ නිවැරදි අදහස් දක්වා ඇත්තේ (රවි, කමලා, රුවිනා අතුරින්),', 'දුර රූපයකි.', 'මධ්‍යම රූපයකි.', 'සමීප රූපයකි.', 'ඉතා සමීප රූපයකි.', 'මධ්‍යම සමීප රූපයකි.', 3, NULL),
(358, 11, 'චිත්‍ර පටයක ප්‍රධාන චරිතය ජීවත් වන පරිසරයේ සුන්දරත්වය විදහා දැක්වෙන රූප රාමුවක් ලබා ගත යුතු බවයි. ඒ සඳහා වඩාත් සුදුසු රූප රාමුව වන්නේ,', 'නිර්නියාමනයයි.', 'පරිභෝජ්‍යකරණයයි.', 'වාණිජකරණයයි.', 'භාණ්ඩ කරණයයි.', 'ගෝලීය කරණයයි.', 3, NULL),
(359, 11, 'එක්තරා රූපවාහිනී ආයතනයක හිමිකරුවෙක් එම සමාගම ආරම්භ කොට වසර 5කට පසු වෙනත් අයකුට විකුණා දමන ලදී. මෙම තත්ත්වයට අදාළ වන මාධ්‍ය ප්‍රවණතාව වන්නේ,', 'සමීක්ෂණය සඳහා භාවිත කළ දත්ත රැස් කළ විධි පිළිබඳ විස්තර', 'සමීක්ෂණය සඳහා භාවිත කළ මූලාශ්‍ර පිළිබඳ විස්තර', 'දත්ත රැස් කිරීමට යොදා ගත් නියැදිය පිළිබඳ විස්තර', 'සමීක්ෂණ ක්‍රියාවලියට පසුබිම් වූ ගැටලුව පිළිබඳ විස්තර', 'දත්ත විශ්ලේෂණ ඇසුරෙන් අනාවරණය කර ගත් කරුණු', 3, NULL),
(360, 11, 'සමීක්ෂණ වාර්තාවක හැඳින්වීමේ කොටසට ඇතුළත් කළ යුත්තේ කුමක්ද?', 'A හා B සම්ප්‍රදායික මාධ්‍යයට අයත්ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් ය.', 'B හා C ජනමාධ්‍යට අයත් ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා D ජනමාධ්‍යට අයත්ය.', 'A හා D සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා C ජනමාධ්‍යට අයත්ය.', 3, NULL),
(361, 11, 'මාධ්‍ය පිළිබඳ ලක්ෂණ (A, B, C, D) පිළිබඳ වඩාත් නිවැරදි වරණය කුමක්ද?', 'සමාජ අවශ්‍යතා මත තත්වාරෝපණය නොවන්නකි.', 'ජනමාධ්‍ය ආරම්භයත් සමග බිහි වී වර්ධනය වූවක් නොවේ.', 'තොරතුරු සමාජයේ සංස්කෘතිය ලෙස හැඳින්විය නොහැකි ය.', 'මානව සමාජ පරිනාමයේ විඥාපන අවධියට අයත් නොවූවකි.', 'පුද්ගල සමාජානුයෝජනයට සහ සංස්කෘතික ක්‍රියාවලියට උපකාරී නොවන්නකි.', 3, NULL),
(362, 12, 'සන්නිවේදන ක්‍රියාවලිය මූලික වශයෙන් සමන්විත වන්නේ,', 'අදහස් වලිනි.', 'සිදුවීම්වලිනි.', 'සංකේත වලිනි.', 'තොරතුරුවලිනි.', 'පුද්ගලයන්ගෙනි.', 1, NULL),
(363, 12, 'සන්නිවේදකයාගේ අදහස් සහ හැගීම් සංදේශ බවට පරිවර්තනය කිරීමේ ක්‍රියාවලිය,', 'පරිකල්පනයයි.', 'විකේතකරණයයි.', 'භාෂණයයි.', 'ආකේතකරණයයි.', 'සංජානනයයි.', 1, NULL),
(364, 12, 'තිර පිටපත් රචකයෙකු තම අත්දැකීම් ඇසුරෙන් සිදු කරන නිර්මාණයක දී දක්නට ලැබෙන සන්නිවේදන වර්ගය කුමක්ද?', 'නිර්මාණාත්මක', 'අන්තර්පුද්ගල', 'ලිඛිත', 'අවිධිමත්', 'අන්තර්වර්තී පුද්ගල', 1, NULL),
(365, 12, 'සන්නිවේදනය හා එය සිදුවන වටපිටාව අතර පවත්නා සම්බන්ධය යනුවෙන් අදහස් කරන්නේ,', 'අරමුණු සහගත වීම ය.', 'සංකේතාත්මක වීම ය.', 'විවිධාකාර වීම ය.', 'සන්දර්භානුගත වීම ය.', 'ඒක මාර්ගික හා ද්විමාර්ගික වීමය.', 1, NULL),
(366, 12, 'දුරකථනය හා ටෙලිග්‍රාෆ් තාක්ෂණය වර්ධනය වීමේ ප්‍රතිඵලයක් ලෙස බිහි වූයේ කුමක්ද?', 'පුවත්පත', 'සඟරාව', 'විද්‍යුත් පුවත්පත', 'රූපවාහිනිය', 'ගුවන් විදුලිය', 1, NULL),
(367, 12, 'අන්තර් ක්‍රියාකාරී සන්නිවේදනයක යෙදීම වඩාත් පහසු වන්නේ,', 'අන්තර් පුද්ගල සන්නිවේදනයේ දීය.', 'සමූහ සන්නිවේදනයේ දී ය.', 'අතථ්‍ය සන්නිවේදනයේ දී ය.', 'යන්ත්‍ර - සහායක අන්තර් පුද්ගල සන්නිවේදනයේ දීය.', 'යන්ත්‍ර - සහායක සමූහ සන්නිවේදනයේ දී ය.', 1, NULL),
(368, 12, 'ෆෙඩරල් සන්නිවේදන කොමිසම යනු,', 'අමෙරිකානු මාධ්‍ය නියාමන ආයතනයකි.', 'බ්‍රිතාන්‍ය ගුවන් විදුලි නියාමන ආයතනයකි.', 'මහජන සේවා දිරිගන්වන ගෝලීය ආයතනයකි.', 'ගුවන් විදුලි තරංග නියාමන අධිකාරියකි.', 'සමාජ මාධ්‍ය නියාමන ආයතනයකි.', 1, NULL),
(369, 12, 'ගුවන් විදුලි මාධ්‍ය වැඩසටහනක දී වැඩිම අවධානය යොමුවන පාර්ශ්වය වන්නේ,', 'සන්නිවේදකයාය.', 'හිමිකරුවාය.', 'අනුග්‍රාහකයාය.', 'ග්‍රාහකයා ය.', 'වාර්තාකරුවා ය.', 1, NULL),
(370, 12, 'එදිනෙදා ජිවිතයට අවශ්‍ය තොරතුරු ඇතුළත් කරමින් නිශ්චිත කාලවකවානුවක දී එකට බැඳ අඛණ්ඩව ප්‍රකාශයට පත් කරනු ලබන්නේ,', 'පුවත්පත් ය.', 'පොත් ය.', 'ආගමික පත්‍රිකාය.', 'සඟරා ය.', 'අණ පනත්ය.', 1, NULL),
(371, 12, 'ජනමාධ්‍ය තොරතුරුවල දැකිය හැකි වඩාත් කැපීපෙනෙන ගුණාංගය වන්නේ,', 'විවිධත්වයයි.', 'සංකීර්ණත්වයයි.', 'දෛනිකත්වයයි.', 'ආකර්ශණීයත්වයයි.', 'විශ්වසනීයත්වයයි.', 1, NULL),
(372, 12, 'තොරතුරු ගබඩා කර සංරක්ෂණය කිරීම සඳහා පදනම සකස් වන්නේ,', 'භාෂාවේ සම්භවයත් සමග ය.', 'ලේඛනයේ ආරම්භයත් සමගය.', 'ජනමාධ්‍යවල ආරම්භයත් සමඟ ය.', 'මුද්‍රණ තාක්ෂණයේ දියුණුවත් සමඟ ය.', 'ඩිජිටල් දත්ත සංචිත කරණයේ ආගමනයත් සමග ය.', 1, NULL),
(373, 12, 'ජනමාධ්‍ය මගින් ඉදිරිපත් වන තොරතුරු පිළිබඳ තීරණ ගනු ලබන්නේ,', 'මාධ්‍ය හිමිකරුවන් ය.', 'දැන්වීම්කරුවන්ය.', 'සංස්කාරකවරුන් ය.', 'දොරටුපාලකයන්ය.', 'නිසි බලධාරින්ය.', 1, NULL),
(374, 12, '\"මහජන සම්බන්ධතා යනු යහපත් සිතින් යුතුව මානව සදාචාර සම්පන්න භාවය ඇති කිරීම සඳහා ගනු ලබන ක්‍රියාමාර්ග බව\" සඳහන් කළේ කවුරුන් ද/ කවර ආයතනයද?', 'එඩ්වඩ් එල්. බර්නීස්', 'චාර්ල්ස් ප්ලැකාඩ්', 'සෑම් බ්ලැක්', 'ජෝශප් ආර්. ඩොමිනික්', 'බ්‍රිතාන්‍ය මහජන සමබන්ධතා පිළිබඳ වරලත් ආයතනය', 1, NULL),
(375, 12, 'පහත අදහස් සලකන්න. A - ග්‍රාහකයාට අනුව වචන තෝරා ගත හැකි ය B - අවධානයෙන් සවන් දීම සිදු කළ හැකි ය C - නිර්වාචික සන්නිවේදනය භාවිත කළ හැකි ය D - නිශ්චිත ධූරාවලියක් දැකගත හැකි ය', 'A හා B', 'A හා C', 'B හා C', 'B හා D', 'C හා D', 1, NULL),
(376, 12, 'මාධ්‍ය සාක්ෂරතාවට අදාළ ඥාන ව්‍යුහ ගොඩනැගෙන්නේ,', 'පලපුරුද්දෙනි.', 'අවිඥානිකවය.', 'පුද්ගලයාගේ අරමුණු ඇසුරෙනි.', 'සමාජ අන්තර් ක්‍රියාකාරිත්වයෙනි.', 'තෝරාගත් තොරතුරු සමූහයක් ඇසුරෙනි.', 1, NULL),
(377, 12, 'භවභෝග ආරක්ෂා කර ගැනීම, අපල උපද්‍රව වලින් වැළකීම හා විනෝදාස්වාදය ලබාදීම වැනි කරුණු අරමුණු කර ගත් සාම්ප්‍රදායික මාධ්‍ය විධික්‍රමයක් වන්නේ,', 'ජන කවියයි.', 'ජන කතාවයි.', 'කෝලම් නාට්‍යයයි.', 'යාතුකර්මයි.', 'සොකරි නාට්‍යයයි.', 1, NULL),
(378, 12, 'වර්තමානයේ දී යමෙකුට අන්තර්ජාලය මගින් පුවත්පත් කියවීමට, ගුවන් විදුලිය ශ්‍රවණය කිරීමට මෙන්ම රූපවාහිනිය හා චිත්‍රපට නැරඹීමට අවස්ථාව හිමි වී තිබේ. මෙම තත්වය හඳුන්වන සංකල්පය වන්නේ,', 'නිර්මහා පරිමාණ කරණයයි.', 'මාධ්‍ය අභිසාරිතාවයි.', 'නිර්නියාමනයයි.', 'ගෝලීය කරණයයි.', 'මාධ්‍ය නියාමනයයි.', 1, NULL),
(379, 12, '\'Many Voices, One World\' කෘතිය ප්‍රකාශයට පත් කරන ලද්දේ,', 'එක්සත් ජාතීන්ගේ සංවිධානයෙනි.', 'නොබැඳි සමුළුවෙනි.', 'යුනෙස්කෝ සංවිධානයෙනි.', 'පොදු රාජ්‍ය මණ්ඩලයෙනි.', 'යුරෝපා සංගමයෙනි.', 1, NULL),
(380, 12, 'මාධ්‍ය සාක්ෂරතාව යනු බහු මාත සහිත සංකල්පයකි. ඊට අයත් ප්‍රධාන මාන වන්නේ,', 'සංජානන, චිත්තවේගී, සෞන්දර්යාත්මක හා සදාචාර මානයි.', 'චිත්තවේගී, සෞන්දර්යාත්මක, සදාචාර හා දේශපාලනික මානයි.', 'සෞන්දර්යාත්මක, සදාචාර, පෞද්ගලික හා අන්තර් ක්‍රියාකාරී මානයි.', 'සදාචාර, පෞද්ගලික, දේශපාලනික හා චිත්තවේගී මානයි.', 'පෞද්ගලික, අන්තර් ක්‍රියාකාරී, චිත්තවේගී හා සංජානන මානයි.', 1, NULL),
(381, 12, 'මානව හිමිකම් පිළිබඳ විශ්ව ප්‍රකාශනය,', 'ගිවිසුමක ස්වභාවය පෙන්නුම් කරන අතර ඍජු නෛතික බැඳීමකින් යුක්ත වූවකි.', 'භාෂණයේ හා ප්‍රකාශනයේ හිමිකම පාදක කර ගත් ලියවිල්ලකි.', 'එක්සත් ජාතීන්ගේ සංවිධානයට අයත් රටවල පුරවැසියන්ට අදාළ වූවකි.', 'පළමු ලෝක යුද්ධයේ අත්දැකීම්වල ප්‍රතිඵලයක් ලෙස ප්‍රකාශයට පත් වූවකි.', 'බොහෝ රටවල මූලික අයිතිවාසිකම් සඳහා පදනම සකස් කරන ලද්දකි.', 1, NULL),
(382, 12, 'නව මාධ්‍ය හා සමාජ මාධ්‍යට විශේෂිත කාර්යයන් වන්නේ,', 'තොරතුරු හා විනෝදාස්වාද සම්පාදනයයි.', 'සමාජානුයෝජනය හා අධ්‍යාපනයයි.', 'විකල්ප මණ්ඩප මෙන්ම සම්බන්ධතා ගොඩනැගීමයි.', 'සුපරීක්ෂණය හා අර්ථකථනයයි.', 'ආරක්ෂකයකු හා ගුරුවරයකුගේ භූමිකාවයි.', 1, NULL),
(383, 12, 'සිනමාව සමග සැසඳීමේ දී රූපවාහිනියට විශේෂිත ලක්ෂණයක් වන්නේ, එය', 'සාමූහික නිර්මාණ කාර්ය සහිත වීම ය.', 'තිර රචනා උපයෝගී කර ගැනීමය.', 'කලාත්මක මාධ්‍යයක් වීම ය.', 'පොදු මාධ්‍යයක් වීම ය.', 'දෘශ්‍ය සාක්ෂරතාව උපයෝගී කර ගැනීම ය.', 1, NULL),
(384, 12, 'සමකාලීන ජනප්‍රිය සංස්කෘතිය තුළ රූපවාහිනී මාධ්‍යය වඩාත් අවධානය යොමු කරන ලක්ෂණය වන්නේ,', 'අධ්‍යාපනයේ වටිනාකමයි.', 'මානව වාදයට ගරු කිරීමයි.', 'අල්පේච්ඡතාවෙහි වටිනාකමයි.', 'සෞන්දර්යාංයාංගයන්හි වැදගත්කමයි.', 'පරිභෝජනයේ ආකර්ෂණයයි.', 1, NULL),
(385, 12, 'මාධ්‍ය විසින් මවනු ලබන මායාව හා යථාර්ථය හඳුනා ගැනීමට අවශ්‍ය ඥානය ගොඩනැගෙන්නේ,', 'මාධ්‍ය අධ්‍යාපනයෙනි.', 'මාධ්‍ය සාක්ෂරතාවෙනි.', 'මාධ්‍ය විචාරයෙනි.', 'මාධ්‍ය විශ්ලේෂණයෙනි.', 'මාධ්‍ය පිළිබඳ අවධානයෙනි.', 1, NULL),
(386, 12, '\"අපේ කාලේ නම් ඔය එක එක ජන මාධ්‍යයන්ගෙන් කියන ඒවට වඩා අපි දැනුම ලබා ගත්තේ අපේ මුතුන් මිත්තන්ගෙන්\" යැයි සීයා කීවේ ය. ඔහු සඳහන් කරන්නේ,', 'ජන විශ්වාස පිළිබඳවයි.', 'ජනප්‍රවාද පිළිබඳවයි.', 'ජනශ්‍රැති පිළිබඳවයි.', 'පුරාණෝක්ති පිළිබඳවයි.', 'ජනකතා පිළිබඳවයි.', 1, NULL),
(387, 12, 'සිට 29 දක්වා ප්‍රශ්න සඳහා පහත සන්නිවේදන ආකෘතිය උපයෝගී කර ගන්න. (කථිකයා -> කථාව -> අවස්ථාව -> ශ්‍රාවකයා -> බලපෑම)', '-', '-', '-', '-', '-', 1, NULL),
(388, 12, 'ඉහත සන්නිවේදන ආකෘතිය පිළිබඳ සදොස් ප්‍රකාශය තෝරන්න.', 'එය බටහිර සන්නිවේදන ආකෘතියකි.', 'එය ජනමාධ්‍ය සම්බන්ධයෙන් ඉදිරිපත් වූ ආකෘතියක් නොවේ.', 'එය සමූහ සන්නිවේදනය පිළිබඳ වැඩි අවධානයක් යොමු කරයි.', 'එය තොරතුරු හුවමාරුව ප්‍රකට කරයි.', 'එය ග්‍රාහකයා පොළඹවා ගැනීම පිළිබඳ අවධානය යොමු කරයි.', 1, NULL),
(389, 12, 'ඉහත ආකෘතියෙහි දක්නට නොලැබෙන එහෙත්, හැරල්ඩ් ඩී. ලැස්වෙල්ගේ සන්නිවේදන ආකෘතියෙහි දක්නට ලැබෙන සන්නිවේදන ක්‍රියාවලියට අයත් මූලිකාංගයක් වන්නේ,', 'නාලිකාවයි.', 'ප්‍රතිපෝෂණයයි.', 'බාධකයයි.', 'අත්දැකීම් පසු තලයයි.', 'සම්ප්‍රේෂකයයි.', 1, NULL),
(390, 12, 'ඉහත (26) හා (27) ප්‍රශ්නවල සඳහන් සන්නිවේදන ආකෘති වලින් ශ්‍රාම් සහ ඔස්ගුඩ්ගේ සන්නිවේදන ආකෘතිය වෙනස් වන්නේ, එමගින්', 'බාධකවල ස්වභාවය ප්‍රකට කරන හෙයිනි.', 'සංකේත පිළිබඳ අවධානය යොමු කරන හෙයිනි.', 'ප්‍රතිපෝෂණ ක්‍රියාවලිය ගම්‍ය කරනු ලබන හෙයිනි.', 'සම්ප්‍රේෂකයේ ක්‍රියාකාරීත්වය පෙන්වා දෙන හෙයිනි.', 'අත්දැකීම් පසු තලය පිළිබඳව දක්වා ඇති හෙයිනි.', 1, NULL),
(391, 12, 'ඉහත (26), (27) හා (28) ප්‍රශ්නවල සඳහන් කිසිදු ආකෘතියක දක්නට නොමැති එහෙත් ෂැනන් සහ විවර්ගේ සන්නිවේදන ආකෘතියෙහි දැකිය හැකි සන්නිවේදන ක්‍රියාවලියේ මූලිකාංගයක් වන්නේ,', 'නාලිකාවයි.', 'බාධකයයි.', 'බලපෑමයි.', 'ප්‍රතිපෝෂණයයි.', 'අවස්ථාවයි.', 1, NULL),
(392, 12, 'රාජ්‍ය ආයතනයක සිදු වූ අයථා ගනුදෙනුවක් පිළිබඳ අදාළ කරුණු තහවුරු කොට ගෙන ජනතාව දැනුවත් කිරීමට පුවත්පත් කලාවේදියකු වන ඔබ අපේක්ෂා කරයි. ඒ සඳහා උපයෝගී කර ගත හැකි වඩාත් යෝග්‍ය නෛතික මූලාශ්‍රය වන්නේ,', 'බුද්ධිමය දේපල පනතයි.', 'ශ්‍රී ලංකා පුවත් පත් මණ්ඩල පනතයි.', 'තොරතුරු දැන ගැනීමේ පනතයි.', 'මානව හිමිකම් පිළිබඳ විශ්ව ප්‍රකාශනයයි.', '1978 ආණ්ඩුක්‍රම ව්‍යවස්ථාවේ 14 (i) (අ) අනු ව්‍යවස්ථාවයි.', 1, NULL),
(393, 12, 'සමීක්ෂණයක වාර්තාව කියවන්නකුට වැදගත් විය හැකි අමතර ලේඛන ආදිය ඇතුළත් කළ යුත්තේ,', 'හැඳින්වීමටයි.', 'ක්‍රම වේදයටයි.', 'දත්ත විශ්ලේෂණයටයි.', 'උපග්‍රන්ථයටයි.', 'ආශ්‍රේය මූලාශ්‍රයන්ටයි.', 1, NULL),
(394, 12, 'නිර්මහා පරිමාණකරණය පිළිබඳ පහත ප්‍රකාශ සලකන්න. A - එය විසිවන සියවසේ අග භාගයේ වර්ධනය වී විසිඑක්වන සියවසේ තවදුරටත් ව්‍යාප්ත විය. B - වීඩියෝ ක්‍රීඩා සහ මාර්ගගත ක්‍රීඩා මෙම ක්‍රියාවලියේ ව්‍යාප්තියට දායක වී තිබේ. C - අසමාන හා විවිධත්වයෙන් යුත් ග්‍රාහක ක්ෂේත්‍රයක් නිර්මාණය වේ. D - තමාගේ රුචියට අනුව සංදේශ තෝරා ගැනීමක් වෙනුවට එම සංදේශ වලට අනිවාර්ය ලෙස නිරාවරණය වීමක් මෙහිදී දැකිය හැකි ය.', 'A හා B පමණි.', 'C හා D පමණි.', 'A, B හා C පමණි.', 'B, C හා D පමණි.', 'A, B, C හා D යන සියල්ලම ය.', 1, NULL),
(395, 12, 'ජනප්‍රිය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'ජනප්‍රිය සංස්කෘතිය තුළ ජන සංස්කෘතියේ ශේෂයන් අන්තර්ගත වේ.', 'ජන සංස්කෘතිය කිසිවිටකත් ජනප්‍රිය සංස්කෘතිය යන්නට පර්යාය පදයක් ලෙස නොසැලකේ.', 'සම්භාව්‍ය සංස්කෘතියට ජනතාව සමීප කරවීම ජනප්‍රිය සංස්කෘතියේ මෙහෙවරකි.', 'කර්මාන්තයක් ලෙස වර්ධනය වීමට ඊට ඇත්තේ සාපේක්ෂ අඩු විභවතාවකි.', 'නිශ්චිත ස්ථානයක් හා කාලයක් වෙන් කර ගත යුතු වීම එහි මූලික ලක්ෂණයකි.', 1, NULL),
(396, 12, 'නිර්වාචික සන්නිවේදනය පිළිබඳ පන්තියේ දී සිසුන් අතර මතු වූ අදහස් කිහිපයක් පහත දැක්වේ.', 'රවි පමණි.', 'කමලා පමණි.', 'රුවිනා පමණි.', 'රවි සහ රුවිනා පමණි.', 'රවි, කමලා හා රුවිනා යන සියල්ලන්ම ය.', 1, NULL),
(397, 12, 'සිනමා වැඩ මුළුවක දී ගුරුතුමා ශිෂ්‍යයෙකුට පැවසුවේ, චිත්‍ර පටයක ප්‍රධාන චරිතය ජීවත් වන පරිසරයේ සුන්දරත්වය විදහා දැක්වෙන රූප රාමුවක් ලබා ගත යුතු බවයි. ඒ සඳහා වඩාත් සුදුසු රූප රාමුව වන්නේ,', 'දුර රූපයකි.', 'මධ්‍යම රූපයකි.', 'සමීප රූපයකි.', 'ඉතා සමීප රූපයකි.', 'මධ්‍යම සමීප රූපයකි.', 1, NULL),
(398, 12, 'එක්තරා රූපවාහිනී ආයතනයක හිමිකරුවෙක් එම සමාගම ආරම්භ කොට වසර 5කට පසු වෙනත් අයකුට විකුණා දමන ලදී. මෙම තත්ත්වයට අදාළ වන මාධ්‍ය ප්‍රවණතාව වන්නේ,', 'නිර්නියාමනයයි.', 'පරිභෝජ්‍යකරණයයි.', 'වාණිජකරණයයි.', 'භාණ්ඩ කරණයයි.', 'ගෝලීය කරණයයි.', 1, NULL),
(399, 12, 'සමීක්ෂණ වාර්තාවක හැඳින්වීමේ කොටසට ඇතුළත් කළ යුත්තේ කුමක්ද?', 'සමීක්ෂණය සඳහා භාවිත කළ දත්ත රැස් කළ විධි පිළිබඳ විස්තර', 'සමීක්ෂණය සඳහා භාවිත කළ මූලාශ්‍ර පිළිබඳ විස්තර', 'දත්ත රැස් කිරීමට යොදා ගත් නියැදිය පිළිබඳ විස්තර', 'සමීක්ෂණ ක්‍රියාවලියට පසුබිම් වූ ගැටලුව පිළිබඳ විස්තර', 'දත්ත විශ්ලේෂණ ඇසුරෙන් අනාවරණය කර ගත් කරුණු', 1, NULL),
(400, 12, 'මාධ්‍ය පිළිබඳ ලක්ෂණ කිහිපයක් පහත දැක්වේ. A - සරල බස් වහර භාවිතය B - බහුවිධ ග්‍රාහකත්වය C - ප්‍රමාදිත ප්‍රතිපෝෂණය D - අත්දැකීම් පාදක වීම', 'A හා B සම්ප්‍රදායික මාධ්‍යයට අයත්ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් ය.', 'B හා C ජනමාධ්‍යට අයත් ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා D ජනමාධ්‍යට අයත්ය.', 'A හා D සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා C ජනමාධ්‍යට අයත්ය.', 1, NULL),
(401, 12, 'මාධ්‍ය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'සමාජ අවශ්‍යතා මත තත්වාරෝපණය නොවන්නකි.', 'ජනමාධ්‍ය ආරම්භයත් සමග බිහි වී වර්ධනය වූවක් නොවේ.', 'තොරතුරු සමාජයේ සංස්කෘතිය ලෙස හැඳින්විය නොහැකි ය.', 'මානව සමාජ පරිනාමයේ විඥාපන අවධියට අයත් නොවූවකි.', 'පුද්ගල සමාජානුයෝජනයට සහ සංස්කෘතික ක්‍රියාවලියට උපකාරී නොවන්නකි.', 1, NULL),
(402, 12, 'මාධ්‍ය පිළිබඳ ස්ත්‍රීවාදී විචාරය හා සම්බන්ධ සදොස් ප්‍රකාශය තෝරන්න.', 'ස්ත්‍රී අයිතිවාසිකම් සම්බන්ධ ලිංගිකත්ව සමානාත්මතාව එහි පදනමයි.', 'එය මාධ්‍ය මගින් කාන්තාවන්ට වෙනස් කොට සැලකීම පිලිබඳ අවධානය යොමු කරයි.', 'මාධ්‍ය මගින් ස්ත්‍රිය ඒකාකෘතික ලෙස නිරූපණය කළ යුතු බව මෙමගින් පිළිගැනේ.', 'ස්වාභාවික ලෙස ස්ත්‍රීත්වය මාධ්‍ය මගින් නිරූපණය නොකරන බව මෙහි දී ඉස්මතු කරයි.', 'ස්ත්‍රීත්වය පිළිබඳ වටිනාකම් ව්‍යාප්ත කිරීම උදෙසා මාධ්‍ය දායක විය යුතු බව මෙමගින් පිළිගැනේ.', 1, NULL),
(403, 12, '\"මහජන සම්බන්ධතාවේ දී සන්නිවේදනය මගින් කිසිවක් නොසැඟවිය යුතු ය\" යන අදහස වඩාත් ඉස්මතුව දැක්වෙන්නේ,', 'ප්‍රචාරණ ආකෘතියේ දී ය.', 'මහජන තොරතුරු ආකෘතියේ දීය.', 'පුවත් නියෝජිත ආකෘතියේ දී ය.', 'ද්විමාර්ගික සමමිතික ආකෘතියේ දී ය.', 'ද්විමාර්ගික අසමමිතික ආකෘතියේ දී ය.', 1, NULL),
(404, 12, 'තොරතුරු අයිතිය මූලික අයිතිවාසිකමක් ලෙස තහවුරු කරන ලද දේශීය ආණ්ඩුක්‍රම ව්‍යවස්ථා සංශෝධනය කුමක්ද?', '13 වන සංශෝධනය', '15 වන සංශෝධනය', '18 වන සංශෝධනය', '19 වන සංශෝධනය', '20 වන සංශෝධනය', 1, NULL),
(405, 12, 'විජය නිවාසයේ ක්‍රිඩකයෙක් වන නිමල්ට ක්‍රීඩා උත්සවයේ සිද්ධි කළමනාකාර තනතුර පැවරිණි. නිමල්ගේ කාර්යයට අවම අදාළත්වයක් දක්වන්නේ,', 'අර්බුද අවස්ථා කළමනා කරණයයි.', 'ඉලක්ක කණ්ඩායම් හඳුනා ගැනීමයි.', 'ස්ථානයක් වෙන් කර ගැනීමයි.', 'අයවැය තීරණය කිරීමයි.', 'නිවේදන කටයුතු කිරීමයි.', 1, NULL),
(406, 12, 'මාධ්‍ය නියාමන ප්‍රවේශ හා ලක්ෂණ කිහිපයක් පහත වගුවෙහි දැක් වේ.', 'AX, BZ, CY', 'AX, BY, CZ', 'AY, BZ, CX', 'AY, BX, CZ', 'AZ, BY, CX', 1, NULL),
(407, 12, 'ජනමාධ්‍යයේ කාර්යභාරය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'අවධානයෙන් සිටිමින් තොරතුරු සම්පාදනය සුපරීක්ෂණයයි.', 'විවිධ සිද්ධීන් විවරණය කරමින් ඉදිරිපත් කිරීම තොරතුරු සම්පාදනයයි.', 'පුද්ගල, සමාජ හැසිරීම් හා සිතුම් පැතුම් වල වෙනසක් ඇති කරවීම සමාජානුයෝජනය යි.', 'පුද්ගලයින් හා විවිධ ආයතන අතර අන්‍යෝන්‍ය සම්බන්ධතා වර්ධනය කිරීම උපදෙස් සම්පාදනය යි.', 'සමාජ වටිනාකම් පිළිබඳ ජනතාව දැනුවත් කර පොදු ගැටලු හා අභියෝග හඳුනා ගැනීමට සැලැස්වීම තොරතුරු සම්පාදනයයි.', 1, NULL),
(408, 12, 'එක්සත් ජාතීන්ගේ සංවිධානය විසින් ඉදිරිපත් කළ අන්තර් සම්බන්ධිත සංවර්ධනය සඳහා වන සන්නිවේදන ප්‍රවේශයක් නොවන්නේ,', 'නියාමනය සඳහා සන්නිවේදනයයි.', 'සමාජීය වෙනස්කම් සඳහා සන්නි වේදනයයි.', 'පාරිසරික සමතුලිතතාව සඳහා සන්නිවේදනයයි.', 'හැසිරීම් වෙනස්කම් සඳහා සන්නි වේදනයයි.', 'දරිද්‍රතාව අවම කිරීම සඳහා සන්නිවේදනයයි.', 1, NULL),
(409, 12, 'රූපලාවන්‍ය නිෂ්පාදන අලෙවි කරන සමාගමකට අයත් වෙබ් අඩවියකට තමන්ගේ බැංකු ගිණුම් විස්තර ඇතුළත් කිරීම නිසා මූල්‍ය වංචාවකට හසු වී ඇති බව නිමාලිට වැටහිනි. මේ පිළිබඳව විසඳුමක් ලබා ගැනීමට ඇය පැමිණිලි කළ යුත්තේ,', 'අදාළ රූපලාවන්‍ය නිෂ්පාදන සමාගමටයි.', 'ශ්‍රී ලංකා විදුලි සංදේශ නියාමන කොමිසමටයි.', 'සිය ගිණුම අයත් බැංකුවටයි.', 'ශ්‍රී ලංකා පරිගණක හදිසි ප්‍රතිචාර සංසදයටයි.', 'ශ්‍රී ලංකා මානව හිමිකම් කොමිසමටයි.', 1, NULL),
(410, 12, 'සමීක්ෂණ වාර්තාවක් ලිවීමේ දී එම අධ්‍යයනය සඳහා පරිශීලනය කරන ලද මූලාශ්‍ර පිලිබඳ තොරතුරු ඇතුළත් කළ යුතු ය. එම මූලාශ්‍රය ග්‍රන්ථයක් නම්, ආශ්‍රේය මූලාශ්‍ර දැක්වීමේ දී වැදගත්කමක් හිමි නොවන්නේ,', 'කර්තෘ නාමයට හා ග්‍රන්ථ නාමයට ය.', 'ග්‍රන්ථ නාමයට හා ප්‍රකාශිත වර්ෂයට.', 'ප්‍රකාශිත වර්ෂයට හා ප්‍රකාශිත ආයතනයට ය.', 'ප්‍රකාශිත ආයතනයට හා ස්ථානයට ය.', 'මුද්‍රණකරු හා බෙදාහරින්නන්ටය.', 1, NULL),
(411, 12, 'සංකේත පිළිබඳ නිදොස් ප්‍රකාශය තෝරන්න.', 'ඇතැම් සංකේත දෘශ්‍යමාන නොවේ.', 'ඉඟි හා ඉරියව් සංකේත නොවේ.', 'සංකේත වැරදුන විට සන්නිවේදනයක් සිදු නොවේ.', 'හැගීම් දැනවීමට සංකේත අවශ්‍ය නොවේ.', 'ගන්ධය සංකේතයක් ලෙස ගිණිය හැකි නොවේ.', 1, NULL),
(412, 13, 'සන්නිවේදන ක්‍රියාවලිය මූලික වශයෙන්‌ සමන්විත වන්නේ,', 'අදහස්වලිනි.', 'සිදුවීමවලිනි.', 'සංකේතවලිනි.', 'තොරතුරුවලිනි.', 'පුද්ගලයන්ගෙනි.', 4, NULL),
(413, 13, 'සන්නිවේදකයාගේ අදහස්‌ සහ හැගීම්‌ සංදේශ ඛවට පරිවර්තනය කිරීමෙ ක්‍රියාවලිය,', 'පරිකල්පනයසි.', 'විකේතකරණයයි..', 'භාෂණයයි.', 'ආකේතකරණයයි.', 'සංජානනයයි.', 2, NULL),
(414, 13, 'තිර පිටපත්‌ රචකයෙකු තම අන්දැකීම්‌ ඇසුරෙන්‌ සිදු කරන නිර්මාණයක දී දක්නට ලැබෙන සන්නිවේදන වර්ගය කුමක්‌ ද?', 'නිර්මාණාත්මක', 'අන්තර්පුද්ගල', 'ලිඛිත', 'අවිධිමන්‌', 'අන්තර්චර්නී පුද්ගල', 1, NULL),
(415, 13, 'සන්නිවේදනය හා එය සිදුවන වටපිටෘව අතර පවත්නා සම්බන්ධය යනුවෙන්‌ අදහස්‌ කරන්නේ,', 'අරමුණු සහගන වීම ය.', 'සංකේතාත්මක වීම ය.', 'විවිධාකාර වීම ය.', 'සන්දර්භානුගත වීම ය.', 'ඒකමාර්ගික හා ද්විමාර්ගික වීම ය.', 3, NULL),
(416, 13, 'දුරකථනය හා ටෙලිග්‍රාෆ්‌ තාක්ෂණය වර්ධනය වීමේ ප්‍රතිඵලයක්‌ ලෙස බිහිවූයේ කුමක්‌ ද?', 'පුවත්පත', 'සඟරාව', 'විද්‍යුත්‌ පුවත්පත', 'රූපවාහිනිය', 'ගුවන්විදුලිය', 3, NULL),
(417, 13, 'ෆෙඩරල්‌ සන්නිවේදන කොමිසම යනු', 'අමෙරිකානු මාධ්‍ය නියාමන ආයතනයකි.', 'බ්‍රිතාන්‍ය ගුවන්විදුලි නියාමන ආයතනයකි.', 'මහජන සේවා දිරිගන්වන ගෝලීය ආයතනයකි.', 'ගුවන්විදුලි තරංග නියාමන අධිකාරියකි.', 'සමාජ මාධ්‍ය නියාමන ආයතනයකි.', 1, NULL),
(418, 13, 'ගුවන්විදුලි මාධ්‍ය වැඩසටහනක දී වැඩිම අවධානය යොමුවන පාර්ශ්වය වන්නේ,', 'සන්නිවේදකයා ය.', 'හිමිකරුවා ය.', 'අනුග්‍රාහකයා ය.', 'ග්‍රාහකයා ය.', 'චෘර්නෘකරැවෘ ය.', 3, NULL),
(419, 13, 'එදිනෙදා ජීවිතයට අවශ්‍ය නොරතුරු ඇතුළත්‌ කරමින්‌ නිශ්චිත\' කාලවකවානුවක දී එකට බැඳ අඛණ්ඩව ප්‍රකාශයට \'පත්‌ කරනු ලබන්නේ,', 'පුවත්පත්‌ ය.', 'පොත්‌ ය.', 'ආගමක පත්‍රිකා ය.', 'සගරා ය.', 'අණ පනත්‌ ය.', 1, NULL),
(420, 13, 'ජනමාධ්‍ය නොරතුරුචල දැකිය හැකි වඩාත්‌ කැපීපෙනෙන ගුණාංගය වන්නේ,', 'විවිධන්වයයි.', 'සංකීර්ණන්වයයි.', 'දෛනිකත්වයයි.', 'ආකර්ශණීයන්වයයි.', 'විශ්වසනීයන්වයයි.', 2, NULL),
(421, 13, 'තොරතුරු ගබඩා කර සංරක්ෂණය කිරීම සඳහා පදනම සකස්‌ චන්නේ,', 'භාෂාවේ සම්භවයන්‌ සමග ය.', 'ලේඛනයේ ආරම්භයත්‌ සමග ය.', 'ජනමාධ්‍යවල ආරම්භයත්‌ සමග ය.', 'මුද්‍රණ තෘක්ෂණයේ දියුණුවත්‌ සමග ය.', 'ඩිජිටල්‌ දන්න සංචිතකරණයේ ආගමනයත්‌ සමග ය.', 3, NULL),
(422, 13, 'ජනමාධ්‍ය මගින්‌ ඉදිරිපත්‌ වන තොරතුරු පිළිබඳ තීරණ ගනු ලබන්නේ, | (1) මාධ්‍ය හිමිකරුවන්‌ ය.', 'දැන්වීමකරුවන්‌ ය.', 'සංස්කාරකවරුන්‌ ය', 'දෞරටුපාලකයන්‌ ය.', 'නිසි බලධාරින්‌ ය.', '-', 3, NULL),
(423, 13, 'මහජන සම්බන්ධනෘ යනු යහපත්‌ සිනින්‌ යුතුව මානව සදංචාර සම්පන්න භාවය ඇති කිරීම සඳහා ගනු ලබන ක්‍රියාමාර්ග ඛව සඳහන්‌ කළේ කවුරුන්‌ ද/කවර ආයනනය ද?', 'එඩ්වඩ්‌ එල්‌. බර්නීස්‌', 'චාර්ල්ස්‌ ප්ලැකාඩ්‌', 'සෑම බ්ලැක්‌', 'ජෝශප්‌ ආර්‌. ඩොමිනික්‌', 'බ්‍රිකාන්‍ය මහජන සමබන්ධනා පිළිබඳ වරලත්‌ ආයනනය', 2, NULL),
(424, 13, 'පහන අදහස්‌ සලකන්න.\r\nA - ග්‍රාහකයාට අනුව වචන තෝරා ගත හැකි ය\r\n B - අවධානයෙන් සවන් දීම සිදු කළ හැකි ය\r\n C - නිර්වාචික සන්නිවේදනය භාවිත කළ හැකි ය \r\nD - නිශ්චිත ධූරාවලියක් දැකගත හැකි ය', 'A හා B', 'A හා C', 'B හා C', 'B හා D', 'C හා D', 3, NULL),
(429, 13, 'මාධ්‍ය සෘක්ෂරතාවට අදාළ ඥාන වැදුහ ගොඩනැගෙන්නේ.', 'පලපුරුද්දෙනි.', 'පුද්ගලයාගේ අරමුණු ඇසුරෙනි.', 'සමාජ අන්තර්‌ ක්‍රියෘකාර්න්වයෙනි.', 'තෝරාගත්‌ තොරතුරු සමූහයක්‌ ඇසුරෙනි.', 'තෝරාගත් තොරතුරු සමූහයක් ඇසුරෙනි.', 2, NULL),
(430, 13, 'භවභෝග ආරක්ෂා කර ගැනීම, අපල උපදුව වලින්‌ වැළකීම භෘ විනෝදාස්වාදය ලබාදීම වැනි කරුණු අරමුණු කර ගන්‌ සාම්ප්‍රදායික මාධ්‍ය චිධික්‍රමයක්‌ වන්නේ,', 'ජන කවියයි.', 'ජන කනාවසී.', 'කෝලම්‌ නාට්‍යයයි.', 'යාතුකර්මයි.', 'කොකටී නාට්‍යයයි.', 1, NULL),
(431, 13, 'වර්තමානයේ දී යමෙකුට අන්තර්ජාලය මගින්‌ පුවත්පත්‌ කියවීමට, ගුවන්විදුලිය ශ්‍රවණය කිරීමට මෙන්‌ ම රූපවාහිනිය හා චිත්‍රපට නැරඹීමට අවස්ථාව හිමි වී තිබේ. මෙම තන්වය හඳුන්වන සංකල්පය වන්නේ,', 'නිර්මභාපරිමාණකරණයයි.', 'මාධ්‍ය අඟිසෘරිනාවයි.', 'නිර්නියාමනයයි.', 'ගෝලීයකරණයයි.', 'මාධ්‍ය නියාමනයයි.', 5, NULL),
(432, 13, '\'Many Voices, One World\' කෘතිය ප්‍රකාශයට පත් කරන ලද්දේ,', 'එක්සත්‌ ජෘතීන්ගේ සංවිධානයෙනි.', 'නොබැඳි සමුළුවෙනි.', 'යුනෙස්කෝ සංවිධානයෙනි.', 'පොදු රාජ්‍ය මණ්ඩලයෙනි.', 'යුරෝපෟ සංගමයෙනි.', 5, NULL),
(433, 13, 'මාධ්‍ය සෘක්ෂරතාව යනු බහු මාන සහින සංකල්පයකි. ඊට අයන්‌ ප්‍රධාන මාන වන්නේ.', 'සංජෘනන, චිත්තවේගී, සෞන්දර්යාත්මක හා සදෘචාර මානි.', 'චිත්තවේගී, සෞන්දර්යාත්මක, සදෘචාර හා දේශපාලනික .මානයි.', 'සෞන්දර්යාත්මක, සදෟචාර, පෞද්ගලික හා අන්තර්‌ ක්‍රියාකාරී මෘනයි.', 'සදාචාර, පෞද්ගලික, දේශපාලනික හා චිත්තවේගී මානයි.', 'පෞද්ගලික, අන්තර්‌ ක්‍රියාකාරී, චිත්තවේගී හා සංජානන මානයි.', 0, NULL),
(434, 13, 'මානව හිමිකම්‌ පිළිබඳ විශ්ව ප්‍රකාශනය,', 'ගිවිශ්‍රමක ස්වභාවය පෙන්නුම්‌ කරන අතර සෘජු නෛනික බැඳීමකින්‌ යුක්ත වූවකි.', 'භාෂණයේ භා ප්‍රකාශනයේ හිමිකම පාදක කර ගන්‌ ලියවිල්ලකි.', 'එක්සත්‌ ජාතීන්ගේ සංවිධානයට අයන්‌ රටවල පුරවැසියන්ට අදාළ වූවකි.', 'පළමු ලෝක යුද්ධයේ අත්දැකීමවල ප්‍රනිඵලයක්‌ ලෙස ප්‍රකංශයට පන්‌ වූවකි.', 'බොහෝ රටචල මූලික අයිතිවාසිකම්‌ සඳහා පදනම සකස්‌ කරන ලද්දකි.', 0, NULL),
(435, 13, 'නව මාධ්‍ය හා සමාජ මාධ්‍යට විශේෂිත කාර්යයන්‌ වන්නේ,', 'නොරතුරු හා විනෝදාස්වාද සම්පෘදනයයි.', 'සමාජානුයෝජනය භෘ අධ්‍යාපනයයි.', 'විකල්ප භුණ්ඩප මෙන්ම කම්ඛන්ධතෘ ගොඩනැගීමයි.', 'සුපරීක්ෂණය හා අර්ථකථනයයි.', 'ආරක්ෂකයකු හා ගුරුවරයකුගේ භූමිකාවයි.', 0, NULL),
(436, 13, 'සමකාලීන ජනප්‍රිය සංස්කෘතිය තුළ රූපවාහිනී මාධ්‍යය වඩාත්‌ අවධානය යොමු කරන ලක්ෂණය වන්නේ,', 'අධ්‍යාපනයේ චටිනෘකමයි.', 'මානවවාදයට ගරු කිරිමයි.', 'අල්පේච්ඡතාවෙහි වටිනාකමයි.', 'සෞන්දර්යාංගයන්හි වැදගන්කමයි.', 'පරිභෝජනයේ ආකර්ෂණයයි.', 0, NULL),
(437, 13, 'මාධ්‍ය විසින්‌ මවනු ලබන මායාව හා යථාර්ථය හඳුනා ගැනීමට අවශ්‍ය ඥානය ගොඩනැගෙන්නේ,', 'මෘධ්‍ය අධ්‍යාපනයෙනි.', 'මාධ්‍ය සෘක්ෂරතාවෙනි.', 'මාධ්‍ය විචාරයෙනි.', 'මාධ්‍ය විශ්ලේෂණයෙනි.', 'මාධ්‍ය පිළිබඳ අවධානයෙනි.', 0, NULL),
(438, 13, '\"අපේ කාලේ නම්‌ ඔය එක එක ජනමාධ්‍යයන්ගෙන්‌ කියන ඒවට වඩා අපි දැනුම ලබා ගත්තේ අපේ මුතුන්‌ මිත්තන්ගෙන්‌” යැයි සීයා කීවේ ය. ඔහු සඳහන්‌ කරන්නේ,', 'ජන විශ්වාස පිළිබඳවසි.', 'ජනප්‍රවාද පිළිබඳවයි.', 'ජනශ්‍රැති පිළිබඳවයි.', 'පුරාණෝක්ති පිළිබඳවයි.', 'ජනකනෘ පිළිබඳවයි.', 0, NULL),
(439, 13, '26 සිට 29 දක්වා ප්‍රශ්න සඳහා පහත සන්නිවේදන ආකෘතිය උපයෝගී කර ගන්න. ලා අවස්ථාව', '-', '-', '-', '-', '-', 0, NULL),
(440, 13, 'ඉහත සන්නිවේදන ආකෘතිය පිළිබඳ සදොස්‌ ප්‍රකාශය තෝරන්න..', 'එය බටහිර සන්නිවේදන ආකෘනියකි.', 'එය ජනමාධ්‍ය සම්බන්ධයෙන්‌ ඉදිරිපත්‌ වූ ආකෘතියක්‌ නොවේ.', 'එය සමූහ සන්නිවේදනය පිළිබඳ වැඩි අවධානයක්‌ යොමු කරයි.', 'එය තොරතුරු හුවමාරුව ප්‍රකට කරයි.', 'එය ග්‍රාහකයා පොළඹවා ගැනීම පිළිබඳ අවධානය යොමු කරයි.', 0, NULL),
(441, 13, 'ඉහත ආකෘතියෙහි දක්නට නොලැබෙන එහෙත්‌, හැරල්ඩ්‌ ඩී. ලැස්වෙල්ගේ සන්නිවේදන ආකෘතියෙහි දක්නට ලැබෙන \"සන්නිවේදන ක්‍රියාවලියට අයත්‌ මූලිකාංගයක්‌ වන්නේ,', 'නාලිකාවසි..', 'ප්‍රනිපෝෂණයයි.', 'බෟධකයයි.', 'අත්දැකීම්‌ පසුතලයයි.', 'සමප්‍රේෂකයයි.', 0, NULL),
(442, 13, 'ඉහත (26) නෘ (27) ප්‍රශ්නවල සඳහන්‌ සන්නිවේදන ආකෘතිවලින්‌ ශ්‍රාම්‌ සහ ඔස්ගුඩ්ගේ සන්නිවේදන ආකෘතිය වෙනස්‌ වන්නේ, එමගින්‌', 'බාධකවල ස්වභාවය ප්‍රකට කරන හෙයිනි.', 'සංකේත පිළිබඳ අවධානය යොමු කරන හෙයිනි.', 'ප්‍රනිපෝෂණ ක්‍රියාවලිය ගම්‍ය කරනු ලබන හෙයිනි.', 'සමප්‍රේෂකයේ ක්‍රියාකාරීත්වය පෙන්වා දෙන හෙයිනි.', 'අත්දැකීම පසුතලය පිළිබඳව දක්වෟ ඇනි හෙයිනි.', 0, NULL),
(443, 13, 'රාජ්‍ය ආයතනයක සිදු වූ අයථා ගනුදෙනුවක්‌ පිළිබඳ අදාළ කරුණු තහවුරු කොටගෙන ජනතාව දැනුවත්‌ කිරීමට පුවත්පත්‌ කලාවේදියකු වන ඔබ අපේක්ෂා කරයි. ඒ සඳහා උපයෝගී කර ගත හැකි වඩාත්‌ යෝග්‍ය නෛනික මූලාශ්‍රය වන්නේ,', 'බුද්ධිමය දේපල පනතයි.', 'ශ්‍රී ලංකා පුවත්පත්‌ මණ්ඩල පනනයි.', 'තොරතුරු දැනගැනීමේ පනනයි.', 'මානව හිමිකම්‌ පිළිබඳ විශ්ව ප්‍රකාශනයයි.', '1978 ආණ්ඩුක්‍රම ව්‍යවස්ථාවේ 14 (1) (අ) අනු ව්‍යවස්ථාවසි.', 0, NULL),
(444, 13, 'සමීක්ෂණයක වාර්තාව කියවන්නකුට වැදගත්‌ විය හැකි අමතර ලේඛන ආදිය ඇතුළත්‌ කළ යුත්තේ,', 'හැඳින්වීමටයි.', 'ක්‍රමවේදයටයි.', 'දත්න විශ්ලේෂණයටයි.', 'උපග්‍රන්ථයටයි..', 'ආශ්‍රේය මූලාශ්‍රයන්ටයි.', 0, NULL),
(445, 13, 'නිර්මභාපරිමාණකරණය පිළිබඳ පහත ප්‍රකාශ සලකන්න.', '-', '-', '-', '-', '-', 0, NULL),
(446, 13, '~ එය විසිවන සියවසේ අග භාගයේ වර්ධනය වී විසිඑක්වන සියවසේ තවදුරටත්‌ ව්‍යාප්ත විය.', '-', '-', '-', '-', '-', 0, NULL),
(447, 13, '- වීඩියෝ ක්‍රීඩා සහ මාර්ගගත ක්‍රීඩා මෙම ක්‍රියාවලියේ ව්‍යෘප්නියට දෘයක වී තිබේ. \'ල - අසමාන හා විවිධන්වයෙන්‌ යුත්‌ ග්‍රාහක ක්ෂේත්‍රයක්‌ නිර්මාණය වේ.', '-', '-', '-', '-', '-', 0, NULL),
(448, 13, '~- තමාගේ රුචියට අනුව සංදේශ තෝරා ගැනීමක්‌ වෙනුවට එම සංදේශවලට අනිවාර්ය ලෙස නිරාවරණය චීමක්‌ මෙහිදී දැකිය හැකි ය. ඉහත ප්‍රක්‍යශ අතුරෙන්‌ නිවැරදි වන්නේ,', '4 හා 7 පමණ.', 'උංහෘ', '-', '-', '-', 0, NULL),
(449, 13, 'පමණි.', '4,47 භෘ ල පමණ.', '-', '-', '-', '-', 0, NULL),
(450, 13, 'පමණි.', '4,7, ල හා', '-', '-', '-', '-', 0, NULL),
(451, 13, 'යන සියල්ලම ය.', '-', '-', '-', '-', '-', 0, NULL),
(452, 13, 'ජනප්‍රිය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'ජනප්‍රිය සංක්කෘනිය තුළ ජන සංස්කෘතියේ ශේෂයන්‌ අන්නර්ගන වේ.', 'සම්භාව්‍ය සංස්කෘතියට ජනතාව සම්ප කරවීම ජනප්‍රිය සංස්කෘතියේ මෙහෙවරකි.', 'කර්මාන්තයක්‌ ලෙස වර්ධනය වීමට ඊට quier සෘතේක්ෂ අඩු විභවතෘවකි.', 'නිශ්චිත ස්ථානයක්‌ හා කාලයක්‌ වෙන්‌ කර ගත යුතු වීම එහි මූලික ලක්ෂණයකි.', '-', 0, NULL),
(453, 13, 'නිර්වාචික සන්නිවේදනය පිළිබඳ පන්නියේ දී සිසුන්‌ අතර මතු වූ අදහස්‌ කිහිපයක්‌ පහත දැක්වේ. - රචි - සංඥා සංකේත භාවිතයට ගනියි. කමලා - ඡායාරූප හෘ පෝස්ටර්‌ මෙයට ඇතුළත්‌ නොවෙයි. \'රුවිනා - ජනවර්ගවලට අනුව මෙය වෙනස්‌ විය හැකි ය. නිර්වාචික සන්නිවේදනය පිළිබඳ නිවැරදි අදහස්‌ දක්වා ඇත්නේ,', 'රච්‌ පමණ. ₹2) කමලා පමණි.', 'රුවිනා පමණ.', 'රච්‌ සහ රුචිනා පමණි.', 'රච, කමලං හා රුචින්‍ය යන සියල්ලන්ම ය.', '-', 0, NULL),
(454, 13, 'සිනමා වැඩමුළුවක දී ගුරුතුමා ශිෂ්‍යයෙකුට පැවසුවේ, චිත්‍රපටයක ප්‍රධාන චරිනය ජීවන්‌ වන පරිසරයේ සුන්දරන්වය විදහා දැක්වෙන රූප රාමුවක්‌ ලබා ගන යුතු බවයි. ඒ සඳහා වඩාත්‌ සුදුසු රූප රාමුව වන්නේ,', 'දුර රූපයකි.', 'ධ්‍යෙම රූපයකි.', 'සමීප රූපයකි.', 'ඉනා සමීප රූපයකි.', 'මධ්‍යම සමීප රූපයකි.', 0, NULL),
(455, 13, 'එක්තරා රූපවාහිනී ආයනනයක හිමිකරුවෙක්‌ එම සමාගම ආරම්භ කොට වසර 5කට පසු වෙනත්‌ අයකුට විකුණා දමන ලදී. මෙම තත්ත්වයට අදාළ වන මාධ්‍ය ප්‍රවණතාව වන්නේ,', 'නිර්නියාමනයසි.', 'පරිභෝජ්‍යකරණයයසි.', 'වාණජකරණයයි.', 'භාණ්ඩකරණයයසි.', 'ගෝලීයකරණයයි.', 0, NULL),
(456, 13, 'සමීක්ෂණ වාර්තාවක හැඳින්වීමේ කොටසට ඇතුළත්‌ කළ යුත්නේ කුමක්‌ ද?', 'සමීක්ෂණය සඳහා භෘවිත කළ දත්ත රැස්‌ කළ විධි පිළිබඳ විස්තර', 'සමීක්ෂණය සඳහා භාවිත කළ මූලාශ්‍ර පිළිබඳ විස්නර', 'දන්ත රැස්‌ කිරීමට යොදා ගන්‌ නියැදිය පිළිබඳ විස්තර', 'සමීක්ෂණ ක්‍රියාවලියට පසුබිම්‌ වූ ගැටලුව පිළිබඳ විස්තර', 'දත්න විශ්ලේෂණය ඇසුරෙන්‌ අනාවරණය කර ගන්‌ කරුණු', 0, NULL),
(457, 13, 'මාධ්‍ය පිළිබඳ ලක්ෂණ කිහිපයක්‌ පහන දැක්වේ.', '-', '-', '-', '-', '-', 0, NULL),
(458, 13, '- සරල බස්මහර භෟෘවිතය', '-', '-', '-', '-', '-', 0, NULL),
(459, 13, '~ බහුවිධ ග්‍රාහකත්වය C - ප්‍රමාදිත ප්‍රනිපෝෂණය', '-', '-', '-', '-', '-', 0, NULL),
(460, 13, '- අන්දැකීම්‌ පාදක වීම ඉහන ලක්ෂණ පිළිබඳ වඩාත්‌ නිවැරදි වරණය කුමක්‌ ද?', '.4 හෟ /7 සම්ප්‍රදායික මාධ්‍යයට අයත්‌ ය.', '.1 භා ( සම්ප්‍රදාසික මෘධ්‍යයට අයන්‌ ය.', '77 හා ල්‌ ජනමාධ්‍යට අයත්‌ ය.', '4 හෘ සම්ප්‍රදායික මාධ්‍යයට අයත්‌ වන අතර /7 හා', '-', 0, NULL),
(461, 13, 'ජනමාධ්‍යට අයන්‌ ය..', '4 භා 49 සම්ප්‍රදායික මාධ්‍යයට අයන්‌ චන අතර (7 භා € ජකමාධ්‍යට අයත්‌ ය.', '-', '-', '-', '-', 0, NULL),
(462, 14, 'පහත දත්ත සලකන්න:', '-', '-', '-', '-', '-', 0, NULL),
(463, 14, '~ සංචේදකයකින්‌ ලබාදෙන උෂ්ණත්ව අගයන්‌', '-', '-', '-', '-', '-', 0, NULL),
(464, 14, '-- පරිගණකයක සුරැකි ගොනුවක නිර්මාතෘගේ නම සහ ඵය නිර්මාණය කළ දිනය (ල __ සමාජ මාධ්‍ය ජාලයක බෙදාගැනෙන පළ කිරීම්‌ (00515) සහ ප්‍රතිචාර ((650001563) එකතුවක්‌ ඉහත දත්තවල නිවැරදි වර්ගීකරණය පහත කවරක දැක්වේ ද?', '4 මහා දත්ත (048 4418), ॥3 ~~ අඛණ්ඩ (0111010115) දන්ත, (0 -~ දත්ත පිළිබඳ දත්ත (1116140414),', '4 -_ අඛණ්ඩ දත්ත. 8 ~~ මහා දන්ත, \'ල_ දන්ත පිළිබඳ දන්න', '', '-', '-', 0, NULL),
(465, 14, 'අඛණ්ඩ දත්ත. 0 ~~ දත්ත පිළිබඳ දත්ත. ~~ මහා දත්ත |', '4 ~~ දත්ත පිළිබඳ දත්ත, 8 ~ මහා දත්ත, € -.. අඛණ්ඩ දත්ත', '-', '-', '-', '-', 0, NULL),
(466, 14, 'පහත කවරක්‌ කාණ්ඩ සැකසුම (1941011 0106655116) සඳහා හොඳ උදාහරණ වේ ද? 7, ~~ දැනට හිස්‌, තමන්ට ආසන්නම රිය ගාල්‌ කිරීමේ ස්ථානය, පරිශීලකයකුට ප්‍රනිදානය කරන පද්ධනියක්‌ B — පරිගණකයක ගොනු, සෑම දිනකම දවස අවසානයේදී, ස්වයංක්‍රීයව උපස්ථනය (0004(:40) කරන පද්ධතියක්‌ C - දවසක්‌ ඇතුළත ලද පාරිභෝගික ඇනවුම්‌, වටිනෘකමේ අනුපිළිවෙළට සකසන පද්ධතියක්‌', '& පමණ @) & සන ॥ පමණ,', '4 සහ ල පමණ', '1 සෲ ල්‌ පමණ', '7, 0 සහ ලි යන සියල්ලම', '-', 0, NULL),
(467, 14, 'පහත ඡේදයේ (දී) සහ (6ි\' හිස්තැන්වලට සුදුසු ආදේශක සගිත පිළිතුර තෝරන්න. LB ඉනා පැරණි වුවත්‌, එය තවමත්‌ ලොව විශාලතම සංස්ථාවල දෛනික මෙහෙයුම්වල ප්‍රධාන කාර්යභාරයක්‌ ඉටු කරයි. බලයට අමතරව, එහි ජනප්‍රියත්වයට හේතු චූ අනෙක්‌ ප්‍රධාන කරුණ වන්නේ ......නී......', '4 ~ වළාකුළු පරිගණනය (([0:)්‌ (0::1:11118) 1 -- එය අන්තර්ජාලය මත නොයැපීමයි.', '4 -_ වළාකුළු පරිගණනය 0 ~ එය සේවාසපයන්නන්‌ (561%16 0:00/146:8) මත', '/!~_ මගා පරිගණකය (11171 frame computer) ॥1 ~ එහි අඩු මිලයි.', '4, ~~ මහා පරිගණකය 0 ~_ එහි විශ්වාසනීයන්වයයි.', '4, මහා පරිගණකය 3 -- අඩු විශාලන්වයයි.', 0, NULL),
(468, 14, 'විශේෂ උපකරණයක මූලික ආධාරයෙන්‌ ඉදිකෙරුනු නිවාස ගම්මානයක්‌ ඇමෙරිකා එක්සත්‌ ජනපදයේ නිමට්මට ආසන්න ය. නිවාසවල බිත්ති මෙම උපකරණය භාවිතයෙන්‌ ගොඩනගා ඇති අතර, අත්තිවාරම්‌ සහ වහල සාම්ප්‍රදායික ක්‍රමයට ගොඩනගා ඇත. ඉදිකිරීම්‌ ක්‍රියාවලියට අවශ්‍ය සේවකයන්ගේ ගණන මෙම උපකරණය අඩු කරන අතර ක්‍රියාවලිය ඉක්මන්‌ සග ලාභදායි කොට, ඉදිකිරීමකදී ඇතිවන නාස්තිය ද අවම කර ඇත. මෙම විශේෂ උපකරණය කුමක්‌ විය හැකි ද?', 'codmmmman (digitizer)', 'විශාල ත්‍රිමාණ මුද්‍රකයක්‌ (31 printer)', 'ලකුණු කරනයක්‌ (0101160)', 'දැක්වුම්‌ උපාංගයක්‌ (1011111016 46:16)', 'මෙහෙයුම්‌ යටියක්‌ (19)/511:10)', 0, NULL),
(469, 14, 'පරිගණක මවු පුචරුවක ඇති සංරචක සහ සම්බන්ධතා සමහරක්‌ පහත රූපයේ දක්වා ඇත. බල සැපයුම £ 1_1 ධූ 7] ක O O \'පංකාව [9] /£) එහි ලේබල 41..18 මගින්‌ පහත දෑ දැක්වේ.', '-', '-', '-', '-', '-', 0, NULL),
(470, 14, '~ දෘඞ ඩිස්කය B - ROMBIOS \'€ .~. ශ්‍රව්‍ය කෙවෙනිය (11410 0011) සඳහා සම්බන්ධකය | D - &g emedBa (network 0011) සඳහා සම්බන්ධකය 1 ॥ ~~ [0910 කෙවෙනිය සඳහා සම්බන්ධකය 70, // සහ 7 ලේබල මගින්‌ පිළිවෙළින්‌ දැක්වෙන්නෙ මොනවා ද? ම', '08 Y -CPU Som (memory)', '|2(~- මතකය න ක්‍ෂ 2 (902', '-', '-', '-', 0, NULL),
(471, 14, 'අලුත්වැඩියා කිරීමකින්‌ පසුව මේස පරිගණකයක්‌ දෘළු ඩිස්කයෙන්‌ ඉනා වේගයෙන්‌ ආරම්භ (0006) චින බව්‌ පුද්ගලයෙක්‌ නිරීක්ෂණය කරයි. අලුත්වැඩියාවේ දී පහත කවරක්‌ සිදු කරන්නට ඇති ද?', '1:71 අඩු කර මෙහෙයුම්‌ පද්ධනිය නැවත ස්ථාපනය කිරීම', 'දෘඞ ඩිස්කය ආකෘතිකරණය (10:0141) කිරීම පමණක්‌', 'අලුත්‌ (1) ධෘවකයක්‌ පිහිටුවීම (1:42!) පමණක්‌', 'පරිගණකය තුළ ඇති කුඩා පංකාව (180) ආදේශ කිරීම පමණක්‌', '-', 0, NULL),
(472, 14, 'දශමය 14.25,, ට තුල්‍ය චන නිවැරදි ද්විමය සංඛ්‍යාව කුමක්‌ ද?', '1001.10 @ 1010.11 @) 101101 @ 111001', '111110', '-', '-', '-', 0, NULL),
(473, 14, 'අෂ්ඨමය 120, ට තුල්‍ය චන නිවැරදි දශමය සංඛ්‍යෘව කුමක්‌ ද?', '10', '17', '80', '136', '640', 0, NULL),
(474, 14, '1:07, ~ 1110 1011 0111,', '-', '-', '-', '-', '-', 0, NULL),
(475, 14, '84,,~ 1010100,', '-', '-', '-', '-', '-', 0, NULL),
(476, 14, '; 753, ” 1001011..', '1 පමණ', '। සෟ !! පමණ', '। සහ 111 පමණ', '1] සහ 11! පමණ', '1, 11 සග 11! යන සියල්ල ම', 0, NULL),
(477, 14, 'පහත වගුවේ දෙවැනි සහ තුන්වැනි පේළිවල ඉංග්‍රීසි වචන දෙකක්‌ සහ 45011 කේතයට අනුව ඒවායේ ද්විමය නිරූපණයන්‌ ඇත. 110! හි ද්විමය නිරූපණය හිස්ව තබා ඇත. o0 8000 | ඞෲ | 1101110 1101111', '-', '-', '-', '-', '-', 0, NULL),
(478, 14, '0100001 | ෴෴෴ ] ] හිස්තැනට සුදුසු ආදේශකය කුමක්‌ ද?', '0100001 1001110 1101111', '1001110 0100001 1101111', '1001110 1101111 0100001', '1101110 0100001 1101111', '101010, @ 10101, () 101100, @ 11001, (9) 111010,', 0, NULL),
(479, 14, '8 &8 පරිපථයේ ප්‍රනිදෘනය (77), පහත කවරකින්‌ ප්‍රකාශ චේ ද? X', '-', '-', '-', '-', '-', 0, NULL),
(480, 14, 'F ¥ ) (X+7)z @ X+D+Z GV X+1Z', 'XF+2Z', '(XV)+z', 'F+z @) 7z @) x0z)', '37492', '-', 0, NULL),
(481, 14, 'දී ඇති කානෝ සිතියම හරහං ලබාගත හැකි සරලතම බූලීය ප්‍රකාශය කුමක්‌ ද? Xy', '-', '-', '-', '-', '-', 0, NULL),
(482, 14, '01 1 10', '-', '-', '-', '-', '-', 0, NULL),
(483, 14, '- i [o[ 1[5 Te] oy', '', '-', '-', '-', '-', 0, NULL),
(484, 14, '= @ =', '07405', '-', '-', '-', '-', 0, NULL),
(485, 14, 'ක්‍රියායන පාලන ඛණ්ඩය (113) සම්බන්ධයෙන්‌ පහත කවරක්‌ නිවැරදි චේ ද? 7, ~ එය ක්‍රියායනයක (0:00655) තොරතුරු කළමනාකරණය කිරීම සඳහා මෙහෙයුම්‌ පද්ධතිය විසින්‌ භාවිත කරනු ලබන දන්ත ව්‍යුහයකි.', '-', '-', '-', '-', '-', 0, NULL),
(486, 14, '~~ එය ක්‍රමලේඛයක්‌ සම්පාදනයේ ((0:01121100)) දී සෑදේ. C — 001 දෙකක [08:91 (01116 අගයන්‌ එක සමාන විය හැකි ය.', '& පමණ (0) 4 සෲ ॥ පමණ', 'A සහ ල පමණ', '8 සග ල්‌ පමණ', '&, 8 සහ ට යන සියල්ල ම', '-', 0, NULL),
(487, 14, 'අමර බහු-පරිශීලක පරිගණකයක්‌ පණගන්වයි. එය ආරම්භ වූ විට සංමෘ එම පරිගණකයට ටර්මිනලයකින්‌ පුරන (10840) වී වෙබ්‌ අතරික්සුවක්‌ අරඹයි. මද චේලාවකට පසුව සාමා තම පයිතන්‌ කේතයේ වැඩකටයුතු කිරීම සඳහා පෘඨ සංක්කෘරකයක්‌ ¢ (text editor) අරඹයි. ඉන්පසු රාණ ද මෙම පරිගණකයට වෙනත්‌ ටර්මිනලයකින්‌ පුරන වී වෙබ්‌ අතරික්සුවක්‌ අරඹයි. එම පරිගණකයේ සකසඝනය මත ධාවනය වන්නන්ගේ නිවැරදි අනුපිළිවෙළක්‌ විය හැක්කේ පහත කවරක්‌ ද?', '8105 _- 05 ~, සාමාගේ වෙබ්‌ අතරික්සු ක්‍රියායනය ~~ 05 ~ සංමගේ පාඨ සංස්කාරක ක්‍රියායනය ~~ 005', '0105 ~_, 05 ~, සාමාගේ වෙබ්‌ අතරික්සු ක්‍රියායනය ~*\' සංමගේ පාඨ සංස්කාරක ක්‍රියායනය ~~ 00 ~~', '0105 ~? සාමාගේ වේඛ්‌ අතරික්සු ක්‍රියායනය ~~* සංමගේ පාඨ සංස්කාරක ක්‍රියායනය ~~ 05 ~~ රාණගේ', '05 11059 ~~ සාමාගේ වෙබ්‌ අතරික්සු ක්‍රියායනය ~~ 05 ~~ සාමගේ පාඨ සංස්කාරක ක්‍රියායනය ~* 05', '05 ~ 0105 ~~ සාමාගේ වෙබ්‌ අතරික්සු ක්‍රියායනය ~* සාමගේ ෆාඨ සංස්කාරක ක්‍රියායනය ~~ 05 ~~.', 0, NULL),
(488, 14, 'ඩිස්කයක කට්ටියක්‌ (block) 830 51225 වේ. බයිට 1959 ක විශාලත්වයකින්‌ යුත්‌ ගොනුවක්‌ එම ඩිස්කයේ ආචය කළ විට, එම ගොනුවට වෙන්‌ කරන ලද බයිට කොපමණ සංඛ්‍යාවක්‌ අපතේ යතු ඇති ද? (0) 89 @ 43', '512 ) 601 (5 147', '-', '-', '-', '-', 0, NULL),
(489, 14, 'පහත රූප දෙක සම්බන්ධයෙන්‌ දී ඇති කවර වගන්ති (1, 1, 111) නිවැරදි ද? (සැ.ය. !\' ~. චොල්ටියතාව । ~~ කාලය) v <A A ) Y 1 ~~ 7, ප්‍රනිසම (4018106) සංඥාවක්‌ නිරූපණය කරයි.', '-', '-', '-', '-', '-', 0, NULL),
(490, 14, '। ॥ 11 ~~ 1 අංකිත (4121(21) සංඥාවක්‌ නිරූපණය කරයි. 1*1 & (/ | 111 ~~ 3 යනු 4, හි සංඛ්‍යාංකනය ((181/126) කළ ස්වරූපයයි.. |! | ම්‌  : | Y t', '1 පමණ', '1! මෙණ', '॥!1 පමණ', '॥! සහ 11] පමණ', '1, 1! සග 11! යන සියල්ල ම', 0, NULL),
(491, 14, 'පොදු සච්ච දුරකථන ජාල (1*$8174) මඟකින්‌ ප්‍රතිසම (4:14108)) සංඥාවක්‌ ලද චිට මොඩමයකික්‌ කුමක්‌ සිදු චේ ද?', 'වඩාත්‌ පැහැදිලි ගුණය සඳහා එය සංඥාව විස්තාරණය (41:10111/) කරයි.', 'ආචයනය (310486) සඳහා එය සංඥෘව සම්පීඩනය (60:1107655) කරයි.', 'එය සංඥාව යෂි අංකිත (421141) ස්වරූපයට චිමුර්ඡනය (06:100111816) කරයි.', 'එය ආරක්ෂාව සඳහා සංඥෟව ගුප්ත කේතනය ((6:16:0/9£) කරයි.', 'සම්ප්‍රේෂණය සඳහා එය සංඥාව තවදුරටත්‌ මුර්ඡනය (1100:11416) කරයි.', 0, NULL),
(492, 14, 'ජාලයක ඇති ස්විචයක්‌ වඩාත්‌ හොඳින්‌ විස්තර කරන්ගන්‌ පහත කුමන ප්‍රකාශයෙන්‌ ද?', 'වඩාත්‌ පැහැදිලි සම්ෆ්‍රේෂණය සඳහා එය දත්ත සංඥා විස්තාරණය (411101113/) කරසි..', 'එය සැම්විටම්‌ පිටතින්‌ එන සියලු දත්ත ජාලයේ ඇති සෑම උපාංගයකටම විකාශය (0104:45[) කරයි.', 'වඩාත්‌ කාර්යක්ෂම සම්ප්‍රේෂණය සඳහා එය දන්ත සම්පීඩනය (50:107655) කරයි.', 'දත්ත අපේක්ෂිත උපාංගයට පමණක්‌ එය දත්ත යොමු කරසි.', 'අනාගත සැකසුම්‌ (0:00655108) සඳහා එය දත්ත ආචය (5106) කරයි.', 0, NULL),
(493, 14, '192.168.100.0/27 1 යොමු කාණ්ඩයේ භාවිතයට ගත හැකි සත්කාරක යොමු කොපමණ පවතී ද?', '16 @) 30 @) 2 (ආ 62 ©) 64', '-', '-', '-', '-', 0, NULL),
(494, 14, 'සම්ප්‍රේෂණ පාලන නියමාචලියේ (11) ගුණාංග පහත ඒවායින්‌ කවරක්‌ ද?', '-', '-', '-', '-', '-', 0, NULL),
(495, 14, '~~ සන්නිචවේදනයක දෝෂ ඇත්නම්‌ ඒවා හඳුනාගැනීම හා නිවැරදි කිරීම', '-', '-', '-', '-', '-', 0, NULL),
(496, 14, '-- දත්ත පැකට්ටුවක්‌ ලැබුණු බව ලබන්නා (£ළල611/6) එචන්නාට (56:146:) දැන්වීම C -- දත්ත පැකවිටු පිළිවෙළින්‌ ලැබෙන බවට සහතික වීම', '& පමණ', '& සහ 0 පමණ', '& සහ ලං පමණ', '8 සෲ ල පමණ', '&, 8! සහ ල යන සියල්ල ම', 0, NULL),
(497, 14, 'නව පද්ධතියක්‌ නිශ්චිත දිනයක දී සේවාලාභියෘට මුද හැරිය යුතු ය. අර්ධ මුදෘ හැරීම්‌ (04:41 06110/6:165) නොතිබිය ශුතු ය. තවද කේතනය ((00/1:18) ඇරඹීමට පෙර, පද්ධති නිර්මිතය (system architecture) m excz® (design)| සම්පූර්ණයෙන්‌ නියම කර තිබිය යුතු ය. මෙම පද්ධතිය සංවර්ධනයට සුදුසු ආකෘති පහත ඒවායින්‌ මොනවා ද?', '-', '-', '-', '-', '-', 0, NULL),
(498, 14, '~ දියඇලි (%456:7811)ප 1 ~ සර්පිල (501:31) (€ ~ සුවල්‍ය (46116)', '& පමණ', '& සහ ॥ පමණ', '4, සහ ල්‌ පමණි', '0 යහ ල පමණ', '4, 0! සහ ෆ්‌ යන සියල්ලම', 0, NULL),
(499, 14, 'DB @dtDm S0 Oped (system development life cycle) අදියර නිවැරදිව පෙළගස්වා ඇත්තේ පහත \'කවරක ද?', 'ශක්‍යතා අධ්‍යයනය ~? අවශ්‍යතා විශ්ලේෂණය ~~ පද්ධති නිර්මාණය ~~* ක්‍රියාත්මක කිරීම ~~ පරීක්ෂාව ~~', 'ශක්‍යතෘ අධ්‍යයනය ~* පද්ධනි නිර්මාණය ~* අවශ්‍යතා විශ්ලේෂණය ~~ ක්‍රියාත්මක කිරීම ~~ පරීක්ෂාව ~~', 'අවශ්‍යතා විග්ලේෂණය ~~ ශක්‍යතා අධ්‍යයනය ~* පද්ධති නිර්මාණය ~~ පරීක්ෂාව ~~\" යෙදවීම ~~ ක්‍රියාත්මක', 'අවශ්‍යතා විශ්ලේෂණය ~~ පද්ධති නිර්මාණය ~~? ශක්‍යතා අධ්‍යයනය “~* යෙදවීම ~~ පරීක්ෂාව ~~ ක්‍රියාත්මක', 'පද්ධති නිර්මාණය ~~* අවශ්‍යතා විශ්ලේෂණය -_* ශක්‍යතා අධ්‍යයනය -* ක්‍රියාත්මක කිරීම ~ පරීක්ෂාව ~*-', 0, NULL);
INSERT INTO `exam_questions` (`question_id`, `exam_id`, `question_text`, `option_1`, `option_2`, `option_3`, `option_4`, `option_5`, `correct_option`, `image_path`) VALUES
(500, 14, 'පද්ධති සංවිර්ධනසේදී භාවිත චන මූලාකෘතිකරණය (7000001081 සම්බන්ධයෙන්‌ පහත කවරක්‌ අසත්‍ය ද්‌ |', 'පද්ධති s (system [6511018) අදියරේදී මූලාකෘති, පරිශීලකයන්ගෙන්‌ අනුමත විය යුතු ය. i', 'මුලාකෘතිකරණය සෑම ව්‍යාපෘතියකටම අවශ්‍ය ගෝ සුදුසු හෝ නොවේ. |', 'සාර්ථක මූලාකෘතිකරණය පරිශීලක අවශ්‍යතා සහ බලාපොරොත්තු ශගාඳින්‌ සපුරාලන පද්ධති සංවර්ධනය', 'පද්ධනියකට වියදම්‌ සහිත පසු වෙනස්කම්‌ කිරීම තුරන්‌ කිරීමට සෘර්ථක මූලාකෘතිකරණය ඉවහල්‌ වේ.', 'මූලාකෘතිකරණයේ වෘසි ලබාගැනීමට මූලාකෘති පිළිබඳ පරිශීලක ප්‍රතිචාර අතිශයින්‌ වැදගත්‌ වේ.', 0, NULL),
(501, 14, 'මෘදුකාංග පරීක්ෂා (5010/4:6 16515) සම්බන්ධයෙන්‌ පහත කවර වගන්නි නිවැරදි වේ ද? 7, ~~ ශ්වේත මංජුසා (1//11106-000() පරීක්ෂාවන්ට, මෘදුකාංගයක අභ්‍යන්තර ව්‍යුහයන්‌ භෘ ක්‍රියාකිරීමේ විධි පිරික්සීම අයත්‌ වේ.', '-', '-', '-', '-', '-', 0, NULL),
(502, 14, '-- සාමාන්‍යයෙන්‌ පද්ධති (51/516:)) පරීක්ෂාවෙන්‌ පසුව ඒකක (11:11) පරීක්ෂාවන්‌ සිදු කරේ. ( ~~ ප්‍රනිග්‍රහණ පරීක්ෂාව (අල060(2110€ 165) සාර්ථක කරගැනීමට පද්ධති සංවර්ධකයින්‌ සෑම පරිශ්‍රමයක්ම දැරිය යුතු ය.', '7 පමණි', '4, සහ 8 පමණ', '& සහ ල පමණ', '8 සහ ල පමණ', '4, 0! සභ ල යන සියල්ල ම', 0, NULL),
(503, 14, 'ප්‍රශ්න අංක 29 ගා 30 සඳහා පිළිතුරු දීමට පගත විස්තරය කියවන්න. \'සිසුන්ට හා අන්‌ අයට කණ්ඩායම්‌ ක්‍රීඩා සඳහා පසල්‌ ක්‍රීඩාපිටිය (පාසලට යාබදව ඇති) වෙන්කර ගැනීම සඳහා ක්‍රීඩාපිටිය වෙන්‌ කරගැනීමේ පද්ධතියක්‌ අවශ්‍ය ය. සෑම වෙන්‌ කිරීමක්ම පැය දෙකක්‌ සඳහා ය. සිසුන්‌ නොවන \'සැම තම චෙන්‌ කරගැනීම්‌ සඳහා ගෙවීමක්‌ කළ යුතු ය. වෙන්‌ කරගැනීම්‌ සිදු කරනුයේ ජාතික හැඳුනුමපත්‌ (41) අංක භාවිතයෙන්‌ ය. ක්‍රීඩාපිටියේ ගේට්ටුවෙන්‌ යම්‌ කණ්ඩායමක්‌ ඇතුල්‌ කිරීමට පෙර 141,” පත්‌ පිරික්සීම සිදු වේ. වෙන්‌ කරගැනීමේ ක්‍රියාවලිය සඳහා භාවිත කළ හැකි ඇල්ගොරිතමයක්‌', '-', '-', '-', '-', '-', 0, NULL),
(504, 14, 'සිට 1) තෙක්‌ හිස්තැන්‌ ලේඛල ද සහිතව \'පහත දැක්වේ. ආරම්භ A පරිනිලනනට උවත්‌ නිරිමන්‌ සිදු කිරිමට අවන්‍ය නී B | c oo Bade, o o8 D o) 609 086 B0 0Bk නිරි දත්ත සමාග ෆාවත්කාලීන කරනන. අවසානය 29, ඉහත ගිස්තැන්‌ සඳහා නිවැරදි ආදේශක දක්වන්නේ පහත කවරක්‌ ද?', '4 ~ දැනට්‌ ඇති වෙන්‌ කිරීම්‌ පෙන්වන්න 3 ~ දිනය. වේලාච්‌ ලබාගන්න ( ~~ *(1ල පංකය ලබාගන්න', '-', '-', '-', '-', 0, NULL),
(505, 14, '~ පරිශීලකයාගේ හරැංණය පත්‌ ගෙවීම සම්පූරණ තරන්න', '4, ~ දැනට ඇති වෙන්‌ කිරිම්‌ පෙන්චන්න !! ~ දිනය වේලාව ලබාගනන (~~ පරිශීලකයාගේ හර ණය පත්‌', '4, ~ දැනට ඇති වෙන්‌ කිරීම්‌ පෙන්වන්න [3 ~~ 541” අංකය ලබාගන්න ල ~ පරිශිලකයාගේ හර්‌ ණය පත්‌', '7; ~- දිනය/චේලාව ලබාගන්න 3 ~~ දැනට ඇති චෙන්‌ කිරිම්‌ පෙන්වන්න ල ~ *(1ල අංකය ලබාගන්න', '-', '-', 0, NULL),
(506, 14, '~ පරිශීලකයාගේ හර/ණය ෆත්‌ ලගවීම සම්පූර්ණ කරන්න', '4, ~ 141 අංකය ලබාගන්න [3 ~~ දැනට ඇති චෙන්‌ කිරිම්‌ පෙන්වන්න ල - දිනය වේලාව ලබාගන්න', '-', '-', '-', '-', 0, NULL),
(507, 14, '~~ පරිසීලකයාගේ හර/ණය පත්‌ ගෙවීම සම්පූර්ණ කරන්න', '-', '-', '-', '-', '-', 0, NULL),
(508, 14, 'ඉහත පද්ධතිය ගැන පහත කවර යෝජනාවක්‌ නුඝුදුගු වේ ද?', 'අවශ්‍ය චිටක, දී ඇති දිනයකට අදාළ චෙන්කිරීම්වල ලැයිස්තුවක්‌ ලබා දිය යුතු ය.', 'සිසුවකු වෙන්‌ කිරීමක්‌ සිදු කරන සෑම විටකම ඔහු/ඇය තම ගෙදර ලිපිනය ඇතුළත්‌ කිරීම අවශ්‍ය කළ යුතු ය.', '$/1ට අංකයේ වලංගුතෘවය පිරික්සීම සුදුසු වේ.', 'වෙන්කිරීම්‌ පාසල්‌ වේලාවන්‌ සමග ඝට්ටනය නොවිය යුතු ය.', 'සාධාරණය සඳහා, යම්‌ 14/1ල්‌ අංකයකට දිනකට ඉඩ දෙන වෙන්‌ කිරීම්‌ ගණන සීමා කළ යුතු ය.', 0, NULL),
(509, 14, 'ආයතනයක වැඩසටහනකට ලියාපදිංචි වී ඇති සිසුවකුට අදෘළ පහත සම්බන්ධය සලකන්න. STUDENT(Sno, Snic, Sname, Sphone, Prog_number) සටහන: Sno - සිසුවාගේ අනන්‍ය ලියාපදිංචි අංකය Snic ~ සිසුවාගේ ජාතික හැඳුනුම්පත්‌ අංකය Sname ~ සිසුවාගේ නම්‌ i Sphone ~ සිසුවාගේ දුරකථන අංකය | Prog_number - සිසුවා ලියාපදිංචි වී ඇති වැඩසටහනේ අනන්‍ය අංකය \'පහත කවරක්‌ නිවැරදි ද? ්& ~ 500 ප්‍රාථමික (0:1014:3/) යතුරක්‌ විය හැකි ය. ॥ ~~ 8016 නිරූප්‍ය ((4:141816) යතුරක්‌ විය හැකි ය. C — Prog_number guozieys (foreign) යතුරක්‌ විය හැකි ය.', '4 පමණ', '4, සහ 8 පමණ', '4 සහ ල පමණ', '8 සහ ල පමණ', '4, 0! සග ෆ යන සියල්ල ම', 0, NULL),
(510, 14, 'පහත කචරක්‌ නිවැරදි ද?', '-', '-', '-', '-', '-', 0, NULL),
(511, 14, '~- වගුවකට බොහෝ නිරූප්‍ය යතුරු ((41101041€ keys) 830 mB ය.', '-', '-', '-', '-', '-', 0, NULL),
(749, 21, 'සන්නිවේදන ක්‍රියාවලිය මූලික වශයෙන් සමන්විත වන්නේ,', 'අදහස් වලිනි.', 'සිදුවීම්වලිනි.', 'සංකේත වලිනි.', 'තොරතුරුවලිනි.', 'පුද්ගලයන්ගෙනි.', 4, NULL),
(750, 21, 'සන්නිවේදකයාගේ අදහස් සහ හැගීම් සංදේශ බවට පරිවර්තනය කිරීමේ ක්‍රියාවලිය,', 'පරිකල්පනයයි.', 'විකේතකරණයයි.', 'භාෂණයයි.', 'ආකේතකරණයයි.', 'සංජානනයයි.', 2, NULL),
(751, 21, 'තිර පිටපත් රචකයෙකු තම අත්දැකීම් ඇසුරෙන් සිදු කරන නිර්මාණයක දී දක්නට ලැබෙන සන්නිවේදන වර්ගය කුමක්ද?', 'නිර්මාණාත්මක', 'අන්තර්පුද්ගල', 'ලිඛිත', 'අවිධිමත්', 'අන්තර්වර්තී පුද්ගල', 4, NULL),
(752, 21, 'සන්නිවේදනය හා එය සිදුවන වටපිටාව අතර පවත්නා සම්බන්ධය යනුවෙන් අදහස් කරන්නේ,', 'අරමුණු සහගත වීම ය.', 'සංකේතාත්මක වීම ය.', 'විවිධාකාර වීම ය.', 'සන්දර්භානුගත වීම ය.', 'ඒක මාර්ගික හා ද්විමාර්ගික වීමය.', 1, NULL),
(753, 21, 'දුරකථනය හා ටෙලිග්‍රාෆ් තාක්ෂණය වර්ධනය වීමේ ප්‍රතිඵලයක් ලෙස බිහි වූයේ කුමක්ද?', 'පුවත්පත', 'සඟරාව', 'විද්‍යුත් පුවත්පත', 'රූපවාහිනිය', 'ගුවන් විදුලිය', 4, NULL),
(754, 21, 'අන්තර් ක්‍රියාකාරී සන්නිවේදනයක යෙදීම වඩාත් පහසු වන්නේ,', 'අන්තර් පුද්ගල සන්නිවේදනයේ දීය.', 'සමූහ සන්නිවේදනයේ දී ය.', 'අතථ්‍ය සන්නිවේදනයේ දී ය.', 'යන්ත්‍ර - සහායක අන්තර් පුද්ගල සන්නිවේදනයේ දීය.', 'යන්ත්‍ර - සහායක සමූහ සන්නිවේදනයේ දී ය.', 2, NULL),
(755, 21, 'ෆෙඩරල් සන්නිවේදන කොමිසම යනු,', 'අමෙරිකානු මාධ්‍ය නියාමන ආයතනයකි.', 'බ්‍රිතාන්‍ය ගුවන් විදුලි නියාමන ආයතනයකි.', 'මහජන සේවා දිරිගන්වන ගෝලීය ආයතනයකි.', 'ගුවන් විදුලි තරංග නියාමන අධිකාරියකි.', 'සමාජ මාධ්‍ය නියාමන ආයතනයකි.', 1, NULL),
(756, 21, 'ගුවන් විදුලි මාධ්‍ය වැඩසටහනක දී වැඩිම අවධානය යොමුවන පාර්ශ්වය වන්නේ,', 'සන්නිවේදකයාය.', 'හිමිකරුවාය.', 'අනුග්‍රාහකයාය.', 'ග්‍රාහකයා ය.', 'වාර්තාකරුවා ය.', 4, NULL),
(757, 21, 'එදිනෙදා ජිවිතයට අවශ්‍ය තොරතුරු ඇතුළත් කරමින් නිශ්චිත කාලවකවානුවක දී එකට බැඳ අඛණ්ඩව ප්‍රකාශයට පත් කරනු ලබන්නේ,', 'පුවත්පත් ය.', 'පොත් ය.', 'ආගමික පත්‍රිකාය.', 'සඟරා ය.', 'අණ පනත්ය.', 5, NULL),
(758, 21, 'ජනමාධ්‍ය තොරතුරුවල දැකිය හැකි වඩාත් කැපීපෙනෙන ගුණාංගය වන්නේ,', 'විවිධත්වයයි.', 'සංකීර්ණත්වයයි.', 'දෛනිකත්වයයි.', 'ආකර්ශණීයත්වයයි.', 'විශ්වසනීයත්වයයි.', 3, NULL),
(759, 21, 'තොරතුරු ගබඩා කර සංරක්ෂණය කිරීම සඳහා පදනම සකස් වන්නේ,', 'භාෂාවේ සම්භවයත් සමග ය.', 'ලේඛනයේ ආරම්භයත් සමගය.', 'ජනමාධ්‍යවල ආරම්භයත් සමඟ ය.', 'මුද්‍රණ තාක්ෂණයේ දියුණුවත් සමඟ ය.', 'ඩිජිටල් දත්ත සංචිත කරණයේ ආගමනයත් සමග ය.', 4, NULL),
(760, 21, 'ජනමාධ්‍ය මගින් ඉදිරිපත් වන තොරතුරු පිළිබඳ තීරණ ගනු ලබන්නේ,', 'මාධ්‍ය හිමිකරුවන් ය.', 'දැන්වීම්කරුවන්ය.', 'සංස්කාරකවරුන් ය.', 'දොරටුපාලකයන්ය.', 'නිසි බලධාරින්ය.', 1, NULL),
(761, 21, '\"මහජන සම්බන්ධතා යනු යහපත් සිතින් යුතුව මානව සදාචාර සම්පන්න භාවය ඇති කිරීම සඳහා ගනු ලබන ක්‍රියාමාර්ග බව\" සඳහන් කළේ කවුරුන් ද/ කවර ආයතනයද?', 'එඩ්වඩ් එල්. බර්නීස්', 'චාර්ල්ස් ප්ලැකාඩ්', 'සෑම් බ්ලැක්', 'ජෝශප් ආර්. ඩොමිනික්', 'බ්‍රිතාන්‍ය මහජන සමබන්ධතා පිළිබඳ වරලත් ආයතනය', 1, NULL),
(762, 21, 'පහත අදහස් සලකන්න. A - ග්‍රාහකයාට අනුව වචන තෝරා ගත හැකි ය B - අවධානයෙන් සවන් දීම සිදු කළ හැකි ය C - නිර්වාචික සන්නිවේදනය භාවිත කළ හැකි ය D - නිශ්චිත ධූරාවලියක් දැකගත හැකි ය ඉහත අදහස් අතුරෙන් ඵලදායි කථන සන්නිවේදනයට වඩාත් අදාළ වන්නේ මින් කවරක්ද?', 'A හා B', 'A හා C', 'B හා C', 'B හා D', 'C හා D', 2, NULL),
(763, 21, 'මාධ්‍ය සාක්ෂරතාවට අදාළ ඥාන ව්‍යුහ ගොඩනැගෙන්නේ,', 'පලපුරුද්දෙනි.', 'අවිඥානිකවය.', 'පුද්ගලයාගේ අරමුණු ඇසුරෙනි.', 'සමාජ අන්තර් ක්‍රියාකාරිත්වයෙනි.', 'තෝරාගත් තොරතුරු සමූහයක් ඇසුරෙනි.', 3, NULL),
(764, 21, 'භවභෝග ආරක්ෂා කර ගැනීම, අපල උපද්‍රව වලින් වැළකීම හා විනෝදාස්වාදය ලබාදීම වැනි කරුණු අරමුණු කර ගත් සාම්ප්‍රදායික මාධ්‍ය විධික්‍රමයක් වන්නේ,', 'ජන කවියයි.', 'ජන කතාවයි.', 'කෝලම් නාට්‍යයයි.', 'යාතුකර්මයි.', 'සොකරි නාට්‍යයයි.', 1, NULL),
(765, 21, 'වර්තමානයේ දී යමෙකුට අන්තර්ජාලය මගින් පුවත්පත් කියවීමට, ගුවන් විදුලිය ශ්‍රවණය කිරීමට මෙන්ම රූපවාහිනිය හා චිත්‍රපට නැරඹීමට අවස්ථාව හිමි වී තිබේ. මෙම තත්වය හඳුන්වන සංකල්පය වන්නේ,', 'නිර්මහා පරිමාණ කරණයයි.', 'මාධ්‍ය අභිසාරිතාවයි.', 'නිර්නියාමනයයි.', 'ගෝලීය කරණයයි.', 'මාධ්‍ය නියාමනයයි.', 2, NULL),
(766, 21, '\'Many Voices, One World\' කෘතිය ප්‍රකාශයට පත් කරන ලද්දේ,', 'එක්සත් ජාතීන්ගේ සංවිධානයෙනි.', 'නොබැඳි සමුළුවෙනි.', 'යුනෙස්කෝ සංවිධානයෙනි.', 'පොදු රාජ්‍ය මණ්ඩලයෙනි.', 'යුරෝපා සංගමයෙනි.', 3, NULL),
(767, 21, 'මාධ්‍ය සාක්ෂරතාව යනු බහු මාත සහිත සංකල්පයකි. ඊට අයත් ප්‍රධාන මාන වන්නේ,', 'සංජානන, චිත්තවේගී, සෞන්දර්යාත්මක හා සදාචාර මානයි.', 'චිත්තවේගී, සෞන්දර්යාත්මක, සදාචාර හා දේශපාලනික මානයි.', 'සෞන්දර්යාත්මක, සදාචාර, පෞද්ගලික හා අන්තර් ක්‍රියාකාරී මානයි.', 'සදාචාර, පෞද්ගලික, දේශපාලනික හා චිත්තවේගී මානයි.', 'පෞද්ගලික, අන්තර් ක්‍රියාකාරී, චිත්තවේගී හා සංජානන මානයි.', 1, NULL),
(768, 21, 'මානව හිමිකම් පිළිබඳ විශ්ව ප්‍රකාශනය,', 'ගිවිසුමක ස්වභාවය පෙන්නුම් කරන අතර ඍජු නෛතික බැඳීමකින් යුක්ත වූවකි.', 'භාෂණයේ හා ප්‍රකාශනයේ හිමිකම පාදක කර ගත් ලියවිල්ලකි.', 'එක්සත් ජාතීන්ගේ සංවිධානයට අයත් රටවල පුරවැසියන්ට අදාළ වූවකි.', 'පළමු ලෝක යුද්ධයේ අත්දැකීම්වල ප්‍රතිඵලයක් ලෙස ප්‍රකාශයට පත් වූවකි.', 'බොහෝ රටවල මූලික අයිතිවාසිකම් සඳහා පදනම සකස් කරන ලද්දකි.', 2, NULL),
(769, 21, 'නව මාධ්‍ය හා සමාජ මාධ්‍යට විශේෂිත කාර්යයන් වන්නේ,', 'තොරතුරු හා විනෝදාස්වාද සම්පාදනයයි.', 'සමාජානුයෝජනය හා අධ්‍යාපනයයි.', 'විකල්ප මණ්ඩප මෙන්ම සම්බන්ධතා ගොඩනැගීමයි.', 'සුපරීක්ෂණය හා අර්ථකථනයයි.', 'ආරක්ෂකයකු හා ගුරුවරයකුගේ භූමිකාවයි.', 1, NULL),
(770, 21, 'සිනමාව සමග සැසඳීමේ දී රූපවාහිනියට විශේෂිත ලක්ෂණයක් වන්නේ, එය', 'සාමූහික නිර්මාණ කාර්ය සහිත වීම ය.', 'තිර රචනා උපයෝගී කර ගැනීමය.', 'කලාත්මක මාධ්‍යයක් වීම ය.', 'පොදු මාධ්‍යයක් වීම ය.', 'දෘශ්‍ය සාක්ෂරතාව උපයෝගී කර ගැනීම ය.', 3, NULL),
(771, 21, 'සමකාලීන ජනප්‍රිය සංස්කෘතිය තුළ රූපවාහිනී මාධ්‍යය වඩාත් අවධානය යොමු කරන ලක්ෂණය වන්නේ,', 'අධ්‍යාපනයේ වටිනාකමයි.', 'මානව වාදයට ගරු කිරීමයි.', 'අල්පේච්ඡතාවෙහි වටිනාකමයි.', 'සෞන්දර්යාංයාංගයන්හි වැදගත්කමයි.', 'පරිභෝජනයේ ආකර්ෂණයයි.', 5, NULL),
(772, 21, 'මාධ්‍ය විසින් මවනු ලබන මායාව හා යථාර්ථය හඳුනා ගැනීමට අවශ්‍ය ඥානය ගොඩනැගෙන්නේ,', 'මාධ්‍ය අධ්‍යාපනයෙනි.', 'මාධ්‍ය සාක්ෂරතාවෙනි.', 'මාධ්‍ය විචාරයෙනි.', 'මාධ්‍ය විශ්ලේෂණයෙනි.', 'මාධ්‍ය පිළිබඳ අවධානයෙනි.', 3, NULL),
(773, 21, '\"අපේ කාලේ නම් ඔය එක එක ජන මාධ්‍යයන්ගෙන් කියන ඒවට වඩා අපි දැනුම ලබා ගත්තේ අපේ මුතුන් මිත්තන්ගෙන්\" යැයි සීයා කීවේ ය. ඔහු සඳහන් කරන්නේ,', 'ජන විශ්වාස පිළිබඳවයි.', 'ජනප්‍රවාද පිළිබඳවයි.', 'ජනශ්‍රැති පිළිබඳවයි.', 'පුරාණෝක්ති පිළිබඳවයි.', 'ජනකතා පිළිබඳවයි.', 2, NULL),
(774, 21, '26 සිට 29 දක්වා ප්‍රශ්න සඳහා පහත සන්නිවේදන ආකෘතිය උපයෝගී කර ගන්න. (කථිකයා -> කථාව -> අවස්ථාව -> ශ්‍රාවකයා -> බලපෑම)\r\n26. ඉහත සන්නිවේදන ආකෘතිය පිළිබඳ සදොස් ප්‍රකාශය තෝරන්න.', 'ff', 'few', 'wfw', 'wfw', 'wfw', 1, NULL),
(775, 21, 'ඉහත සන්නිවේදන ආකෘතිය පිළිබඳ සදොස් ප්‍රකාශය තෝරන්න.', 'එය බටහිර සන්නිවේදන ආකෘතියකි.', 'එය ජනමාධ්‍ය සම්බන්ධයෙන් ඉදිරිපත් වූ ආකෘතියක් නොවේ.', 'එය සමූහ සන්නිවේදනය පිළිබඳ වැඩි අවධානයක් යොමු කරයි.', 'එය තොරතුරු හුවමාරුව ප්‍රකට කරයි.', 'එය ග්‍රාහකයා පොළඹවා ගැනීම පිළිබඳ අවධානය යොමු කරයි.', 2, NULL),
(776, 21, 'ඉහත ආකෘතියෙහි දක්නට නොලැබෙන එහෙත්, හැරල්ඩ් ඩී. ලැස්වෙල්ගේ සන්නිවේදන ආකෘතියෙහි දක්නට ලැබෙන සන්නිවේදන ක්‍රියාවලියට අයත් මූලිකාංගයක් වන්නේ,', 'නාලිකාවයි.', 'ප්‍රතිපෝෂණයයි.', 'බාධකයයි.', 'අත්දැකීම් පසු තලයයි.', 'සම්ප්‍රේෂකයයි.', 2, NULL),
(777, 21, 'ඉහත (26) හා (27) ප්‍රශ්නවල සඳහන් සන්නිවේදන ආකෘති වලින් ශ්‍රාම් සහ ඔස්ගුඩ්ගේ සන්නිවේදන ආකෘතිය වෙනස් වන්නේ, එමගින්', 'බාධකවල ස්වභාවය ප්‍රකට කරන හෙයිනි.', 'සංකේත පිළිබඳ අවධානය යොමු කරන හෙයිනි.', 'ප්‍රතිපෝෂණ ක්‍රියාවලිය ගම්‍ය කරනු ලබන හෙයිනි.', 'සම්ප්‍රේෂකයේ ක්‍රියාකාරීත්වය පෙන්වා දෙන හෙයිනි.', 'අත්දැකීම් පසු තලය පිළිබඳව දක්වා ඇති හෙයිනි.', 5, NULL),
(778, 21, 'ඉහත (26), (27) හා (28) ප්‍රශ්නවල සඳහන් කිසිදු ආකෘතියක දක්නට නොමැති එහෙත් ෂැනන් සහ විවර්ගේ සන්නිවේදන ආකෘතියෙහි දැකිය හැකි සන්නිවේදන ක්‍රියාවලියේ මූලිකාංගයක් වන්නේ,', 'නාලිකාවයි.', 'බාධකයයි.', 'බලපෑමයි.', 'ප්‍රතිපෝෂණයයි.', 'අවස්ථාවයි.', 4, NULL),
(779, 21, 'රාජ්‍ය ආයතනයක සිදු වූ අයථා ගනුදෙනුවක් පිළිබඳ අදාළ කරුණු තහවුරු කොට ගෙන ජනතාව දැනුවත් කිරීමට පුවත්පත් කලාවේදියකු වන ඔබ අපේක්ෂා කරයි. ඒ සඳහා උපයෝගී කර ගත හැකි වඩාත් යෝග්‍ය නෛතික මූලාශ්‍රය වන්නේ,', 'බුද්ධිමය දේපල පනතයි.', 'ශ්‍රී ලංකා පුවත් පත් මණ්ඩල පනතයි.', 'තොරතුරු දැන ගැනීමේ පනතයි.', 'මානව හිමිකම් පිළිබඳ විශ්ව ප්‍රකාශනයයි.', '1978 ආණ්ඩුක්‍රම ව්‍යවස්ථාවේ 14 (i) (අ) අනු ව්‍යවස්ථාවයි.', 2, NULL),
(780, 21, 'සමීක්ෂණයක වාර්තාව කියවන්නකුට වැදගත් විය හැකි අමතර ලේඛන ආදිය ඇතුළත් කළ යුත්තේ,', 'හැඳින්වීමටයි.', 'ක්‍රම වේදයටයි.', 'දත්ත විශ්ලේෂණයටයි.', 'උපග්‍රන්ථයටයි.', 'ආශ්‍රේය මූලාශ්‍රයන්ටයි.', 3, NULL),
(781, 21, 'නිර්මහා පරිමාණකරණය පිළිබඳ පහත ප්‍රකාශ සලකන්න. A - එය විසිවන සියවසේ අග භාගයේ වර්ධනය වී විසිඑක්වන සියවසේ තවදුරටත් ව්‍යාප්ත විය. B - වීඩියෝ ක්‍රීඩා සහ මාර්ගගත ක්‍රීඩා මෙම ක්‍රියාවලියේ ව්‍යාප්තියට දායක වී තිබේ. C - අසමාන හා විවිධත්වයෙන් යුත් ග්‍රාහක ක්ෂේත්‍රයක් නිර්මාණය වේ. D - තමාගේ රුචියට අනුව සංදේශ තෝරා ගැනීමක් වෙනුවට එම සංදේශ වලට අනිවාර්ය ලෙස නිරාවරණය වීමක් මෙහිදී දැකිය හැකි ය. ඉහත ප්‍රකාශ අතුරෙන් නිවැරදි වන්නේ,', 'A හා B පමණි.', 'C හා D පමණි.', 'A, B හා C පමණි.', 'B, C හා D පමණි.', 'A, B, C හා D යන සියල්ලම ය.', 4, NULL),
(782, 21, 'ජනප්‍රිය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'ජනප්‍රිය සංස්කෘතිය තුළ ජන සංස්කෘතියේ ශේෂයන් අන්තර්ගත වේ.', 'ජන සංස්කෘතිය කිසිවිටකත් ජනප්‍රිය සංස්කෘතිය යන්නට පර්යාය පදයක් ලෙස නොසැලකේ.', 'සම්භාව්‍ය සංස්කෘතියට ජනතාව සමීප කරවීම ජනප්‍රිය සංස්කෘතියේ මෙහෙවරකි.', 'කර්මාන්තයක් ලෙස වර්ධනය වීමට ඊට ඇත්තේ සාපේක්ෂ අඩු විභවතාවකි.', 'නිශ්චිත ස්ථානයක් හා කාලයක් වෙන් කර ගත යුතු වීම එහි මූලික ලක්ෂණයකි.', 1, NULL),
(783, 21, 'නිර්වාචික සන්නිවේදනය පිළිබඳ පන්තියේ දී සිසුන් අතර මතු වූ අදහස් කිහිපයක් පහත දැක්වේ. රවි: සංඥා සංකේත භාවිතයට ගනියි. කමලා: ඡායාරූප හා පෝස්ටර් මෙයට ඇතුළත් නොවෙයි. රුවිනා: ජනවර්ගවලට අනුව මෙය වෙනස් විය හැකිය. නිර්වාචික සන්නිවේදනය පිළිබඳ නිවැරදි අදහස් දක්වා ඇත්තේ,', 'රවි පමණි.', 'කමලා පමණි.', 'රුවිනා පමණි.', 'රවි සහ රුවිනා පමණි.', 'රවි, කමලා හා රුවිනා යන සියල්ලන්ම ය.', 2, NULL),
(784, 21, 'සිනමා වැඩ මුළුවක දී ගුරුතුමා ශිෂ්‍යයෙකුට පැවසුවේ, චිත්‍ර පටයක ප්‍රධාන චරිතය ජීවත් වන පරිසරයේ සුන්දරත්වය විදහා දැක්වෙන රූප රාමුවක් ලබා ගත යුතු බවයි. ඒ සඳහා වඩාත් සුදුසු රූප රාමුව වන්නේ,', 'දුර රූපයකි.', 'මධ්‍යම රූපයකි.', 'සමීප රූපයකි.', 'ඉතා සමීප රූපයකි.', 'මධ්‍යම සමීප රූපයකි.', 5, NULL),
(785, 21, 'එක්තරා රූපවාහිනී ආයතනයක හිමිකරුවෙක් එම සමාගම ආරම්භ කොට වසර 5කට පසු වෙනත් අයකුට විකුණා දමන ලදී. මෙම තත්ත්වයට අදාළ වන මාධ්‍ය ප්‍රවණතාව වන්නේ,', 'නිර්නියාමනයයි.', 'පරිභෝජ්‍යකරණයයි.', 'වාණිජකරණයයි.', 'භාණ්ඩ කරණයයි.', 'ගෝලීය කරණයයි.', 3, NULL),
(786, 21, 'සමීක්ෂණ වාර්තාවක හැඳින්වීමේ කොටසට ඇතුළත් කළ යුත්තේ කුමක්ද?', 'සමීක්ෂණය සඳහා භාවිත කළ දත්ත රැස් කළ විධි පිළිබඳ විස්තර', 'සමීක්ෂණය සඳහා භාවිත කළ මූලාශ්‍ර පිළිබඳ විස්තර', 'දත්ත රැස් කිරීමට යොදා ගත් නියැදිය පිළිබඳ විස්තර', 'සමීක්ෂණ ක්‍රියාවලියට පසුබිම් වූ ගැටලුව පිළිබඳ විස්තර', 'දත්ත විශ්ලේෂණ ඇසුරෙන් අනාවරණය කර ගත් කරුණු', 4, NULL),
(787, 21, 'මාධ්‍ය පිළිබඳ ලක්ෂණ කිහිපයක් පහත දැක්වේ. A - සරල බස් වහර භාවිතය B - බහුවිධ ග්‍රාහකත්වය C - ප්‍රමාදිත ප්‍රතිපෝෂණය D - අත්දැකීම් පාදක වීම ඉහත ලක්ෂණ පිළිබඳ වඩාත් නිවැරදි වරණය කුමක්ද?', 'A හා B සම්ප්‍රදායික මාධ්‍යයට අයත්ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් ය.', 'B හා C ජනමාධ්‍යට අයත් ය.', 'A හා C සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා D ජනමාධ්‍යට අයත්ය.', 'A හා D සම්ප්‍රදායික මාධ්‍යයට අයත් වන අතර B හා C ජනමාධ්‍යට අයත්ය.', 3, NULL),
(788, 21, 'මාධ්‍ය සංස්කෘතිය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'සමාජ අවශ්‍යතා මත තත්වාරෝපණය නොවන්නකි.', 'ජනමාධ්‍ය ආරම්භයත් සමග බිහි වී වර්ධනය වූවක් නොවේ.', 'තොරතුරු සමාජයේ සංස්කෘතිය ලෙස හැඳින්විය නොහැකි ය.', 'මානව සමාජ පරිනාමයේ විඥාපන අවධියට අයත් නොවූවකි.', 'පුද්ගල සමාජානුයෝජනයට සහ සංස්කෘතික ක්‍රියාවලියට උපකාරී නොවන්නකි.', 3, NULL),
(789, 21, 'මාධ්‍ය පිළිබඳ ස්ත්‍රීවාදී විචාරය හා සම්බන්ධ සදොස් ප්‍රකාශය තෝරන්න.', 'ස්ත්‍රී අයිතිවාසිකම් සම්බන්ධ ලිංගිකත්ව සමානාත්මතාව එහි පදනමයි.', 'එය මාධ්‍ය මගින් කාන්තාවන්ට වෙනස් කොට සැලකීම පිලිබඳ අවධානය යොමු කරයි.', 'මාධ්‍ය මගින් ස්ත්‍රිය ඒකාකෘතික ලෙස නිරූපණය කළ යුතු බව මෙමගින් පිළිගැනේ.', 'ස්වාභාවික ලෙස ස්ත්‍රීත්වය මාධ්‍ය මගින් නිරූපණය නොකරන බව මෙහි දී ඉස්මතු කරයි.', 'ස්ත්‍රීත්වය පිළිබඳ වටිනාකම් ව්‍යාප්ත කිරීම උදෙසා මාධ්‍ය දායක විය යුතු බව මෙමගින් පිළිගැනේ.', 4, NULL),
(790, 21, '\"මහජන සම්බන්ධතාවේ දී සන්නිවේදනය මගින් කිසිවක් නොසැඟවිය යුතු ය\" යන අදහස වඩාත් ඉස්මතුව දැක්වෙන්නේ,', 'ප්‍රචාරණ ආකෘතියේ දී ය.', 'මහජන තොරතුරු ආකෘතියේ දීය.', 'පුවත් නියෝජිත ආකෘතියේ දී ය.', 'ද්විමාර්ගික සමමිතික ආකෘතියේ දී ය.', 'ද්විමාර්ගික අසමමිතික ආකෘතියේ දී ය.', 4, NULL),
(791, 21, 'තොරතුරු අයිතිය මූලික අයිතිවාසිකමක් ලෙස තහවුරු කරන ලද දේශීය ආණ්ඩුක්‍රම ව්‍යවස්ථා සංශෝධනය කුමක්ද?', '13 වන සංශෝධනය', '15 වන සංශෝධනය', '18 වන සංශෝධනය', '19 වන සංශෝධනය', '20 වන සංශෝධනය', 1, NULL),
(792, 21, 'විජය නිවාසයේ ක්‍රිඩකයෙක් වන නිමල්ට ක්‍රීඩා උත්සවයේ සිද්ධි කළමනාකාර තනතුර පැවරිණි. නිමල්ගේ කාර්යයට අවම අදාළත්වයක් දක්වන්නේ,', 'අර්බුද අවස්ථා කළමනා කරණයයි.', 'ඉලක්ක කණ්ඩායම් හඳුනා ගැනීමයි.', 'ස්ථානයක් වෙන් කර ගැනීමයි.', 'අයවැය තීරණය කිරීමයි.', 'නිවේදන කටයුතු කිරීමයි.', 3, NULL),
(793, 21, 'මාධ්‍ය නියාමන ප්‍රවේශ හා ලක්ෂණ කිහිපයක් පහත වගුවෙහි දැක් වේ. A: ස්වයං නියාමනය - X: දැඩි දේශපාලන බලයක් සහිත වේ B: සහනියාමනය - Y: රාජ්‍ය මැදිහත් වීමෙන් තොර වේ C: ව්‍යවස්ථාපිත නියාමනය - Z: නීතිය මගින් ස්ථාපිතයි ඉහත නියාමන ප්‍රවේශ වලට අදාළ නිවැරදි ලක්ෂණ ගලපා ඇති වරණය තෝරන්න.', 'AX, BZ, CY', 'AX, BY, CZ', 'AY, BZ, CX', 'AY, BX, CZ', 'AZ, BY, CX', 3, NULL),
(794, 21, 'ජනමාධ්‍යයේ කාර්යභාරය පිළිබඳ නිවැරදි ප්‍රකාශය තෝරන්න.', 'අවධානයෙන් සිටිමින් තොරතුරු සම්පාදනය සුපරීක්ෂණයයි.', 'විවිධ සිද්ධීන් විවරණය කරමින් ඉදිරිපත් කිරීම තොරතුරු සම්පාදනයයි.', 'පුද්ගල, සමාජ හැසිරීම් හා සිතුම් පැතුම් වල වෙනසක් ඇති කරවීම සමාජානුයෝජනය යි.', 'පුද්ගලයින් හා විවිධ ආයතන අතර අන්‍යෝන්‍ය සම්බන්ධතා වර්ධනය කිරීම උපදෙස් සම්පාදනය යි.', 'සමාජ වටිනාකම් පිළිබඳ ජනතාව දැනුවත් කර පොදු ගැටලු හා අභියෝග හඳුනා ගැනීමට සැලැස්වීම තොරතුරු සම්පාදනයයි.', 3, NULL),
(795, 21, 'එක්සත් ජාතීන්ගේ සංවිධානය විසින් ඉදිරිපත් කළ අන්තර් සම්බන්ධිත සංවර්ධනය සඳහා වන සන්නිවේදන ප්‍රවේශයක් නොවන්නේ,', 'නියාමනය සඳහා සන්නිවේදනයයි.', 'සමාජීය වෙනස්කම් සඳහා සන්නි වේදනයයි.', 'පාරිසරික සමතුලිතතාව සඳහා සන්නිවේදනයයි.', 'හැසිරීම් වෙනස්කම් සඳහා සන්නි වේදනයයි.', 'දරිද්‍රතාව අවම කිරීම සඳහා සන්නිවේදනයයි.', 1, NULL),
(796, 21, 'රූපලාවන්‍ය නිෂ්පාදන අලෙවි කරන සමාගමකට අයත් වෙබ් අඩවියකට තමන්ගේ බැංකු ගිණුම් විස්තර ඇතුළත් කිරීම නිසා මූල්‍ය වංචාවකට හසු වී ඇති බව නිමාලිට වැටහිනි. මේ පිළිබඳව විසඳුමක් ලබා ගැනීමට ඇය පැමිණිලි කළ යුත්තේ,', 'අදාළ රූපලාවන්‍ය නිෂ්පාදන සමාගමටයි.', 'ශ්‍රී ලංකා විදුලි සංදේශ නියාමන කොමිසමටයි.', 'සිය ගිණුම අයත් බැංකුවටයි.', 'ශ්‍රී ලංකා පරිගණක හදිසි ප්‍රතිචාර සංසදයටයි.', 'ශ්‍රී ලංකා මානව හිමිකම් කොමිසමටයි.', 2, NULL),
(797, 21, 'සමීක්ෂණ වාර්තාවක් ලිවීමේ දී එම අධ්‍යයනය සඳහා පරිශීලනය කරන ලද මූලාශ්‍ර පිලිබඳ තොරතුරු ඇතුළත් කළ යුතු ය. එම මූලාශ්‍රය ග්‍රන්ථයක් නම්, ආශ්‍රේය මූලාශ්‍ර දැක්වීමේ දී වැදගත්කමක් හිමි නොවන්නේ,', 'කර්තෘ නාමයට හා ග්‍රන්ථ නාමයට ය.', 'ග්‍රන්ථ නාමයට හා ප්‍රකාශිත වර්ෂයට.', 'ප්‍රකාශිත වර්ෂයට හා ප්‍රකාශිත ආයතනයට ය.', 'ප්‍රකාශිත ආයතනයට හා ස්ථානයට ය.', 'මුද්‍රණකරු හා බෙදාහරින්නන්ටය.', 2, NULL),
(798, 21, 'සංකේත පිළිබඳ නිදොස් ප්‍රකාශය තෝරන්න.', 'ඇතැම් සංකේත දෘශ්‍යමාන නොවේ.', 'ඉඟි හා ඉරියව් සංකේත නොවේ.', 'සංකේත වැරදුන විට සන්නිවේදනයක් සිදු නොවේ.', 'හැගීම් දැනවීමට සංකේත අවශ්‍ය නොවේ.', 'ගන්ධය සංකේතයක් ලෙස ගිණිය හැකි නොවේ.', 5, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `exam_results`
--

CREATE TABLE `exam_results` (
  `result_id` int(11) NOT NULL,
  `exam_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `score` int(11) NOT NULL,
  `total_questions` int(11) NOT NULL,
  `attempted_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `exam_results`
--

INSERT INTO `exam_results` (`result_id`, `exam_id`, `student_id`, `score`, `total_questions`, `attempted_at`) VALUES
(1, 3, 0, 3, 50, '2025-12-12 15:40:29'),
(2, 4, 0, 27, 50, '2025-12-12 16:15:21'),
(3, 10, 0, 23, 50, '2025-12-12 16:54:09'),
(4, 10, 0, 0, 50, '2025-12-12 18:11:43'),
(5, 20, 0, 8, 20, '2025-12-12 21:00:53'),
(6, 20, 0, 6, 20, '2025-12-12 21:01:53'),
(7, 20, 0, 4, 20, '2025-12-12 21:02:51'),
(8, 1, 0, 0, 0, '2025-12-12 21:03:01'),
(9, 21, 0, 18, 50, '2025-12-12 21:20:23');

-- --------------------------------------------------------

--
-- Table structure for table `expenses`
--

CREATE TABLE `expenses` (
  `exp_id` int(11) NOT NULL,
  `description` varchar(255) NOT NULL,
  `amount` decimal(10,2) NOT NULL,
  `date` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `expenses`
--

INSERT INTO `expenses` (`exp_id`, `description`, `amount`, `date`) VALUES
(1, 'fff', 120000.00, '2025-12-02 16:18:01');

-- --------------------------------------------------------

--
-- Table structure for table `newsletter_subs`
--

CREATE TABLE `newsletter_subs` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `subscribed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `newsletter_subs`
--

INSERT INTO `newsletter_subs` (`id`, `email`, `subscribed_at`) VALUES
(1, 'sahashrajanith@gmail.com', '2025-12-12 04:22:35'),
(2, 'janith@gmail.com', '2025-12-12 04:26:04');

-- --------------------------------------------------------

--
-- Table structure for table `online_exams`
--

CREATE TABLE `online_exams` (
  `exam_id` int(11) NOT NULL,
  `teacher_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `stream` varchar(50) NOT NULL,
  `subject` varchar(100) NOT NULL,
  `duration` int(11) NOT NULL COMMENT 'Minutes',
  `approval_status` enum('Pending','Approved','Rejected') DEFAULT 'Pending',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `online_exams`
--

INSERT INTO `online_exams` (`exam_id`, `teacher_id`, `title`, `stream`, `subject`, `duration`, `approval_status`, `created_at`) VALUES
(1, 5, 'media 2025 LAST TERM ', 'Arts', 'media ', 50, 'Approved', '2025-12-12 09:32:12'),
(10, 5, 'BIO 2025 last term ', 'Bio Science', 'BIO', 20, 'Approved', '2025-12-12 11:13:56'),
(11, 5, 'tt', 'Bio Science', 'kjhjkhg', 15, 'Rejected', '2025-12-12 11:32:52'),
(12, 5, 'ad', 'Bio Science', 'wDD', 33, 'Rejected', '2025-12-12 11:48:46'),
(13, 5, 'ghj', 'Bio Science', 'wdwdw', 22, 'Approved', '2025-12-12 12:01:59'),
(14, 5, 'sgvrgh', 'Bio Science', 'sefe', 44, 'Approved', '2025-12-12 12:21:56'),
(21, 6, 'wdwdwd', 'Arts', 'Sinhala ', 22, 'Approved', '2025-12-12 15:41:37');

-- --------------------------------------------------------

--
-- Table structure for table `past_lessons`
--

CREATE TABLE `past_lessons` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `class_id` int(11) NOT NULL,
  `teacher_id` int(11) NOT NULL,
  `video_url` varchar(500) NOT NULL,
  `cover_image` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `payment_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL DEFAULT 1,
  `month` varchar(20) NOT NULL,
  `year` int(4) NOT NULL DEFAULT 2025,
  `amount` decimal(10,2) NOT NULL,
  `payment_status` enum('paid','pending','failed') NOT NULL DEFAULT 'paid',
  `transaction_id` varchar(100) DEFAULT NULL,
  `method` varchar(20) NOT NULL DEFAULT 'Cash',
  `payment_type` varchar(20) NOT NULL DEFAULT 'Full',
  `paid_date` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `payments`
--

INSERT INTO `payments` (`payment_id`, `student_id`, `class_id`, `month`, `year`, `amount`, `payment_status`, `transaction_id`, `method`, `payment_type`, `paid_date`) VALUES
(2, 1, 1, 'November', 2025, 2500.00, 'paid', NULL, 'Card', 'Full', '2025-11-30 12:28:35'),
(3, 1, 1, 'May', 2025, 2500.00, 'paid', NULL, 'Card', 'Half', '2025-11-30 12:39:16'),
(6, 1, 1, 'November', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full', '2025-11-30 13:36:13'),
(7, 1, 1, 'December', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full', '2025-12-01 17:32:52'),
(8, 6, 1, 'December', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full', '2025-12-02 12:16:38'),
(11, 1, 1, 'January', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full', '2025-12-02 14:29:26'),
(12, 1, 1, 'January', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-02 14:43:59'),
(13, 1, 1, 'January', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-02 14:59:18'),
(14, 1, 1, 'April', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-02 15:09:39'),
(15, 1, 1, 'February', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-02 15:09:49'),
(16, 7, 1, 'January', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-02 15:15:59'),
(17, 7, 1, 'November', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-02 15:29:37'),
(18, 5, 1, 'January', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-02 15:54:19'),
(19, 1, 1, 'August', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-08 09:46:17'),
(20, 5, 1, 'September', 2025, 1250.00, 'paid', NULL, 'Cash', 'Half Payment', '2025-12-08 09:48:34'),
(21, 5, 1, 'February', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-08 10:44:37'),
(22, 9, 1, 'January', 2025, 2500.00, 'paid', NULL, 'Cash', 'Full Payment', '2025-12-08 10:51:58'),
(23, 1, 1, 'March', 2025, 1250.00, 'paid', NULL, 'Cash', 'Half Payment', '2025-12-09 12:29:37');

-- --------------------------------------------------------

--
-- Table structure for table `salaries`
--

CREATE TABLE `salaries` (
  `salary_id` int(11) NOT NULL,
  `teacher_id` int(11) NOT NULL,
  `payment_month` varchar(7) NOT NULL,
  `amount` decimal(10,2) NOT NULL,
  `payment_date` datetime DEFAULT current_timestamp(),
  `status` enum('paid','pending') NOT NULL DEFAULT 'paid'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `student_id` int(11) NOT NULL,
  `reg_number` varchar(20) NOT NULL,
  `full_name` varchar(150) NOT NULL,
  `nic` varchar(20) NOT NULL,
  `dob` date NOT NULL,
  `gender` varchar(10) NOT NULL,
  `school` varchar(150) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `student_phone` varchar(15) DEFAULT NULL,
  `parent_phone` varchar(15) NOT NULL,
  `email` varchar(150) NOT NULL,
  `stream` varchar(50) NOT NULL,
  `batch` varchar(10) NOT NULL,
  `photo` varchar(255) DEFAULT NULL,
  `registered_date` datetime DEFAULT current_timestamp(),
  `status` int(11) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`student_id`, `reg_number`, `full_name`, `nic`, `dob`, `gender`, `school`, `address`, `student_phone`, `parent_phone`, `email`, `stream`, `batch`, `photo`, `registered_date`, `status`) VALUES
(1, 'ST2025001', 'janith', '200011234567', '2025-11-04', 'Male', 'richmend', 'galle', '0740614128', '0773093941', 'nuwanthanadee2005@gmail.com', 'Art', '2025', 'ST2025001.png', '2025-11-27 10:39:50', 1),
(5, 'ST2025004', 'damsara', '200801401349', '2025-12-11', 'Male', 'mahinda college', 'galle', '0773093941', '0773093941', 'janith@gmail.com', 'Tech', '2027', 'ST2025004.jpg', '2025-12-02 11:51:33', 1),
(6, 'ST2025005', 'ravindu', '200801401349', '2025-12-10', 'Male', 'ff', 'fbcnn', '0773093941', '0773093941', 'janith@gmail.com', 'Tech', '2027', 'ST2025005.jpg', '2025-12-02 11:56:28', 1),
(7, 'ST2025006', 'Ravindu chandeepa', '200401401349', '2025-12-10', 'Male', 'ff', 'galle', '0773093941', '0773093941', 'Ravindu@gmail.com', 'Maths', '2027', 'ST2025006.jpg', '2025-12-02 14:24:02', 1),
(8, 'ST2025007', 'chamika', '200612121212', '2025-12-17', 'Male', '', 'baddegama', '0766411887', '0766411887', 'chamika@gmail.com', 'Tech', '2026', 'ST2025007.jpg', '2025-12-04 08:04:07', 1),
(9, 'ST2025008', 'iruja pasandul', '200530301877', '2025-10-29', 'Male', 'siridhamma college', 'bangalawatta', '0774258282', '0774258282', 'iruja@gmail.com', 'Tech', '2025', 'ST2025008.jpg', '2025-12-08 10:51:35', 1),
(10, 'ST2025009', 'chamudi apsara', '201101401349', '2025-12-10', 'Female', 'Sumangala', 'galle', '0773093941', '0773093941', 'chamudi@gmail.com', 'Bio', '2026', 'ST2025009.jpg', '2025-12-12 15:32:39', 1);

-- --------------------------------------------------------

--
-- Table structure for table `study_materials`
--

CREATE TABLE `study_materials` (
  `material_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `class_id` int(11) NOT NULL,
  `file_path` varchar(500) NOT NULL,
  `uploaded_by` int(11) NOT NULL,
  `uploaded_on` timestamp NOT NULL DEFAULT current_timestamp(),
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `system_settings`
--

CREATE TABLE `system_settings` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` varchar(255) NOT NULL,
  `description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `system_settings`
--

INSERT INTO `system_settings` (`setting_key`, `setting_value`, `description`) VALUES
('allow_registration', 'yes', 'නව ශිෂ්‍ය ලියාපදිංචියට අවසර දෙන්න (yes/no)'),
('monthly_fee_default', '1500.00', 'පෙරනිමි මාසික ගාස්තු මුදල'),
('system_name', 'AL Class Management System', 'පද්ධතියේ නම');

-- --------------------------------------------------------

--
-- Table structure for table `teachers`
--

CREATE TABLE `teachers` (
  `teacher_id` int(11) NOT NULL,
  `teacher_number` varchar(20) NOT NULL,
  `password` varchar(255) NOT NULL,
  `full_name` varchar(150) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `subject` varchar(100) NOT NULL,
  `description` text DEFAULT NULL,
  `qualifications` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `status` int(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `teachers`
--

INSERT INTO `teachers` (`teacher_id`, `teacher_number`, `password`, `full_name`, `phone`, `subject`, `description`, `qualifications`, `image`, `status`, `created_at`) VALUES
(2, 'TC2025002', '295001', 'Dinesh Muthugala', '', 'Biology', 'In addition to his academic qualifications, Muthugala is a well-known Biology lecturer in Sri Lanka and is the founder of DM Education Private Limited. He is also an entrepreneur and film producer. ', NULL, '1765341990_6938fb26a3253.jpg', 1, '2025-12-04 08:43:07'),
(3, 'TC2025003', '770370', 'Ravindu bandaranayake', '0713510441', 'ICT', 'He holds a B.Sc. (Hons) in Cybersecurity and Forensics from the University of Gloucestershire, United Kingdom. He previously studied Software Engineering at the Sri Lanka Institute of Information Technology (SLIIT) and Electronics at Wayamba University of Sri Lanka (WUSL).', NULL, '1765342852_6938fe84f3f0c.jpg', 1, '2025-12-04 09:05:45'),
(4, 'TC2025004', '243687', 'Darshana Ukuwela', '0713510441', 'Physics', 'BSc (Hons) Physics | University Of Peradeniya', NULL, '1765345145_6939077937bbd.jpg', 1, '2025-12-04 09:48:23'),
(5, 'TC2025005', '880619', 'Tissa Jananayake', '0773099341', 'Biology', 'B.Sc. Hon\'s (Microbiology) Sp. (Kelaniya) P.G. Dip. in Psychological Counseling (Colombo), PhD(USSR)', NULL, '1765341762_6938fa42caec4.jpg', 1, '2025-12-05 14:11:06'),
(6, 'TC2025006', '101937', 'Akila Vimanga Senevirathna', '0716548262', 'Arts', 'Thinking\r\nSearching\r\nAkila Vimanga Senevirathna is a\r\ntutor and teacher known for offering classes in the Sinhala language, and a search result indicates he holds a B.A. degree. His specific area of focus is teaching Sinhala language for GCE Ordinary Level (O/L) and Advanced Level (A/L) students in Sri Lanka.', NULL, '1765085853_6935129d42433.jpg', 1, '2025-12-07 05:37:33'),
(7, 'TC2025007', '878802', 'Amith Pussella', '0773093941', 'Physics', 'Mr. Amit Pussella is an experienced lecturer with nearly 30 years of experience in the field of Physics, having entered the field from the University of Colombo. Since it is possible to connect in any way, both online and physical, a child from any part of the country can easily participate in this course.', NULL, '1765342736_6938fe106295b.jpg', 1, '2025-12-08 03:23:28'),
(8, 'TC2025008', '740853', 'Madushan Neranjan', '0704849142', 'Combined Maths', 'BSc (Hons) in T&LM Faculty of Engineering | University of Moratuwa', NULL, '1765341287_6938f8676626c.jpg', 1, '2025-12-10 04:34:47'),
(10, 'TC2025009', '444475', 'Anuradha Perera', '0741785456', 'Physics', 'University of Moratuwa - Faculty of Engineering', NULL, '1765349676_6939192c316e0.jpg', 1, '2025-12-10 06:54:36'),
(12, 'TC2025010', '150448', 'Kelum Senanayake', '0767287752', 'Chemistry', 'B.Sc (Hons) U.S.J, P.G Dip in Edu', NULL, '1765350270_69391b7ede088.jpg', 1, '2025-12-10 07:04:30'),
(13, 'TC2025011', '179098', 'Amila Dasanayake', '0741785456', 'Chemistry', 'Faculty of Medicine, University of Colombo', NULL, '1765350516_69391c7463ba6.jpg', 1, '2025-12-10 07:08:36'),
(14, 'TC2025012', '786434', 'Bhanuka Ekanayaka', ' 0711039004', 'ICT', 'B.Sc(ICT) Hons - University of Moratuwa ', NULL, '1765350998_69391e56e33fd.png', 1, '2025-12-10 07:16:38'),
(15, 'TC2025013', '575395', 'Janaka Abeywardana', '0781452430', 'Combined Maths', 'B.Sc (Mathematics) Hons University of Moratuwa', NULL, '1765351375_69391fcfedeca.jpg', 1, '2025-12-10 07:22:55');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('Admin','Teacher','Reception') NOT NULL DEFAULT 'Admin',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `username`, `password`, `role`, `created_at`) VALUES
(1, 'admin', '1234', 'Admin', '2025-11-27 04:39:07');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `attendance`
--
ALTER TABLE `attendance`
  ADD PRIMARY KEY (`attendance_id`),
  ADD KEY `student_id` (`student_id`);

--
-- Indexes for table `classes`
--
ALTER TABLE `classes`
  ADD PRIMARY KEY (`class_id`);

--
-- Indexes for table `enrollments`
--
ALTER TABLE `enrollments`
  ADD PRIMARY KEY (`enrollment_id`),
  ADD KEY `student_id` (`student_id`),
  ADD KEY `class_id` (`class_id`);

--
-- Indexes for table `exams`
--
ALTER TABLE `exams`
  ADD PRIMARY KEY (`exam_id`);

--
-- Indexes for table `exam_marks`
--
ALTER TABLE `exam_marks`
  ADD PRIMARY KEY (`mark_id`),
  ADD KEY `exam_id` (`exam_id`),
  ADD KEY `student_id` (`student_id`);

--
-- Indexes for table `exam_questions`
--
ALTER TABLE `exam_questions`
  ADD PRIMARY KEY (`question_id`),
  ADD KEY `exam_id` (`exam_id`);

--
-- Indexes for table `exam_results`
--
ALTER TABLE `exam_results`
  ADD PRIMARY KEY (`result_id`);

--
-- Indexes for table `expenses`
--
ALTER TABLE `expenses`
  ADD PRIMARY KEY (`exp_id`);

--
-- Indexes for table `newsletter_subs`
--
ALTER TABLE `newsletter_subs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `online_exams`
--
ALTER TABLE `online_exams`
  ADD PRIMARY KEY (`exam_id`);

--
-- Indexes for table `past_lessons`
--
ALTER TABLE `past_lessons`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`payment_id`),
  ADD KEY `student_id` (`student_id`),
  ADD KEY `class_id` (`class_id`);

--
-- Indexes for table `salaries`
--
ALTER TABLE `salaries`
  ADD PRIMARY KEY (`salary_id`),
  ADD KEY `teacher_id` (`teacher_id`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`student_id`),
  ADD UNIQUE KEY `reg_number` (`reg_number`);

--
-- Indexes for table `study_materials`
--
ALTER TABLE `study_materials`
  ADD PRIMARY KEY (`material_id`);

--
-- Indexes for table `system_settings`
--
ALTER TABLE `system_settings`
  ADD PRIMARY KEY (`setting_key`);

--
-- Indexes for table `teachers`
--
ALTER TABLE `teachers`
  ADD PRIMARY KEY (`teacher_id`),
  ADD UNIQUE KEY `teacher_number` (`teacher_number`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `attendance`
--
ALTER TABLE `attendance`
  MODIFY `attendance_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `classes`
--
ALTER TABLE `classes`
  MODIFY `class_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `enrollments`
--
ALTER TABLE `enrollments`
  MODIFY `enrollment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `exams`
--
ALTER TABLE `exams`
  MODIFY `exam_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `exam_marks`
--
ALTER TABLE `exam_marks`
  MODIFY `mark_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `exam_questions`
--
ALTER TABLE `exam_questions`
  MODIFY `question_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=799;

--
-- AUTO_INCREMENT for table `exam_results`
--
ALTER TABLE `exam_results`
  MODIFY `result_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `expenses`
--
ALTER TABLE `expenses`
  MODIFY `exp_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `newsletter_subs`
--
ALTER TABLE `newsletter_subs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `online_exams`
--
ALTER TABLE `online_exams`
  MODIFY `exam_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `past_lessons`
--
ALTER TABLE `past_lessons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `payment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `salaries`
--
ALTER TABLE `salaries`
  MODIFY `salary_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `students`
--
ALTER TABLE `students`
  MODIFY `student_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `study_materials`
--
ALTER TABLE `study_materials`
  MODIFY `material_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `teachers`
--
ALTER TABLE `teachers`
  MODIFY `teacher_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `attendance`
--
ALTER TABLE `attendance`
  ADD CONSTRAINT `attendance_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`) ON DELETE CASCADE;

--
-- Constraints for table `enrollments`
--
ALTER TABLE `enrollments`
  ADD CONSTRAINT `enrollments_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `enrollments_ibfk_2` FOREIGN KEY (`class_id`) REFERENCES `classes` (`class_id`) ON DELETE CASCADE;

--
-- Constraints for table `exam_marks`
--
ALTER TABLE `exam_marks`
  ADD CONSTRAINT `exam_marks_ibfk_1` FOREIGN KEY (`exam_id`) REFERENCES `exams` (`exam_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `exam_marks_ibfk_2` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`) ON DELETE CASCADE;

--
-- Constraints for table `exam_questions`
--
ALTER TABLE `exam_questions`
  ADD CONSTRAINT `exam_questions_ibfk_1` FOREIGN KEY (`exam_id`) REFERENCES `online_exams` (`exam_id`) ON DELETE CASCADE;

--
-- Constraints for table `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `payments_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `payments_ibfk_2` FOREIGN KEY (`class_id`) REFERENCES `classes` (`class_id`) ON DELETE CASCADE;

--
-- Constraints for table `salaries`
--
ALTER TABLE `salaries`
  ADD CONSTRAINT `salaries_ibfk_1` FOREIGN KEY (`teacher_id`) REFERENCES `teachers` (`teacher_id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
